["Mount Shiretoko (知床岳, Shiretoko-dake) is a volcano located on the Shiretoko Peninsula in Hokkaidō, Japan. The mountain consists of non-alkali mafic rocks and andesite. Mount Shiretoko is in Shari town, in Shari District of Abashiri Subprefecture.","","Mount Chienbetsu (知円別岳, Chienbetsu-dake) is a volcano located on the Shiretoko Peninsula in Hokkaido, Japan.","Mount Sashirui (サシルイ岳, Sashirui-dake) is a volcano located on the Shiretoko Peninsula in Hokkaido, northeastern Japan.","Mount Rausu (羅臼岳, Rausu-dake) is a stratovolcano on the Shiretoko Peninsula in Hokkaidō, Japan. It sits on the border between the towns of Shari and Rausu. Mount Rausu is the northeasternmost Holocene volcano on Hokkaidō. It is one of the 100 famous mountains in Japan.\nMount Rausu's opening festival is held annually on July 3. This day officially opens the climbing season.In the past 2200 years it is believed that Mount Rausu erupted thrice, with a Plinian Eruption roughly 1400 years ago and a pyroclastic flow about 500 years ago.","Mount Onnebetsu (遠音別岳, Onnebetsu-dake) is a quaternary stratovolcano. Its summit is 1,330.2 metres (4,364 ft) above sea level. It is located on Hokkaido's Shiretoko Peninsula on the border of Shari in Shari District, Abashiri and Rausu in Menashi District, Nemuro.","Mount Unabetsu (海別岳, Unabetsu-dake) is a quaternary stratovolcano. Its summit is 1,419.3 metres (4,656 ft). It is located on Hokkaido's Shiretoko Peninsula on the border of Shari in Shari District, Abashiri and Shibetsu in Shibetsu District, Nemuro.","Mount Shari (斜里岳, shari-dake) is a quaternary stratovolcano and one of Japan's 100 famous mountains. Its summit is 1,547 metres (5,075 ft). The summit consists of Mount Shari, Southern Mount Shari (南斜里岳, minamishari-dake) and the western ridge. It is located on the Hokkaidō's Shiretoko Peninsula on the border of Shari and Kiyosato in Shari District, Abashiri and Shibetsu in Shibetsu District, Nemuro.","Mount Shibetsu (標津岳, Shibetsu-dake) is a volcano located on the Shiretoko Peninsula in Hokkaido, northeastern Japan.","","","","Mount Oakan (雄阿寒岳, Oakan-dake) is a shield volcano located in Akan National Park in Hokkaidō, Japan.","Mount Meakan (雌阿寒岳, Meakan-dake) is an active stratovolcano located in Akan National Park in Hokkaidō, Japan. It is the tallest mountain in the Akan Volcanic Complex. \nThe volcano consists of nine overlapping cones that grew out of the Akan caldera, on the shores of Lake Akan. Mount Meakan has a triple crater at its summit. According to its name and local legend, Mount Meakan is the female counterpart to Mount Oakan on the other side of Lake Akan.","Mount Meakan (雌阿寒岳, Meakan-dake) is an active stratovolcano located in Akan National Park in Hokkaidō, Japan. It is the tallest mountain in the Akan Volcanic Complex. \nThe volcano consists of nine overlapping cones that grew out of the Akan caldera, on the shores of Lake Akan. Mount Meakan has a triple crater at its summit. According to its name and local legend, Mount Meakan is the female counterpart to Mount Oakan on the other side of Lake Akan.","","Mount Rebun (礼文岳, Rebun-dake) is the highest point on Rebun Island in Rebun,  Hokkaidō, Japan. The mountain consists of marine sedimentary rocks from the Early Cretaceous period, 149–97 million years ago.","","Mount Poroshiri (幌尻岳, Poroshiri-dake) or sometimes Mount Horoshiri is located in the Hidaka Mountains, Hokkaidō, Japan. Its name was derived from a phonetic kanji transcription of the Ainu words for \"great mountain\", poro-shiri. It is the highest mountain in the Hidaka range, and is one of the 100 famous mountains in Japan.","","","","Mount Hako (函岳, Hako-dake) is a mountain in the Kitami Mountains. It is located on the border of Bifuka, Otoineppu and Esashi, Hokkaidō, Japan.\nMount Hako is made from mafic non-alkali rock from 15 to 7 million years old.","Mount Piyashiri (ピヤシリ山, Piyashiri-san) is a mountain in the Kitami Mountains. It is located on the border of Nayoro, Ōmu and Shimokawa, Hokkaidō, Japan.","","Mount Uenshiri (ウエンシリ岳, Uenshiri-dake) is a mountain in the Kitami Mountains. It is located on the border of Nishiokoppe, Shimokawa, and Takinoue, Hokkaidō, Japan.","Mount Shokotsu (渚滑岳, Shokotsu-dake) is a mountain in the Kitami Mountains. It is located in Takinoue, Hokkaidō, Japan.","Mount Teshio (天塩岳, Teshio-dake) is the tallest mountain in the Kitami Mountains. It is located on the border of Shibetsu and Takinoue, Hokkaidō, Japan. It is the source of the Teshio River.","Mount Chitokaniushi (チトカニウシ山, Chitokaniushi-san) is the second tallest mountain in the Kitami Mountains. It is located on the border of Kamikawa and Engaru, Hokkaidō, Japan.","","","","","","","","","","","","may refer to","Mount Oputateshike (オプタテシケ山, Oputateshike-yama) is a mountain of the Tokachi Volcanic Group.","Mount Biei (美瑛岳, Biei-dake) is a stratovolcano located in the Tokachi Volcanic Group, Hokkaidō, Japan. The mountain sits between the larger Mount Tokachi to the southwest and shorter Biei Fuji to the northeast. It forms part of the border between Shintoku and Biei towns.","may refer to","Mount Kamihorokamettoku (上ホロカメットク山, Kami-horokamettoku-san) is a mountain located in the Tokachi Volcanic Group, Hokkaidō, Japan.","Mount Furano (富良野岳, Furano-dake) is a mountain located in the Tokachi Volcanic Group, Hokkaidō, Japan.","Mount Mikuni (三国山, Mikuni-san or Mikuni-yama) is the name of several mountains in Japan including:\n\nMount Mikuni (Hokkaidō), in the Ishikari Mountains in Hokkaidō\nMount Mikuni (Gifu), any one of three mountains in Gifu Prefecture","Mount Ishikari (石狩岳, Ishikari-dake) is part of the Ishikari Mountains, Hokkaidō, Japan. On its slopes are the head waters of the Ishikari River.","Mount Otofuke (音更山, Otofuke-yama) is part of the Ishikari Mountains, Hokkaidō, Japan.","Mount Nipesotsu (ニペソツ山, Nipesotsu-yama) is a lava dome located in the Nipesotsu-Maruyama Volcanic Group of the Ishikari Mountains, Hokkaido, Japan.","Mount Upepesanke (ウペペサンケ山, Upepesanke-yama) is a lava dome located in the Nipesotsu-Maruyama Volcanic Group of the Ishikari Mountains, Hokkaido, Japan.","","Mount Sahoro (佐幌岳, Sahorodake) is located in the Hidaka Mountains, Hokkaidō, Japan. It is the site of the Sahoro Ski Resort.\nThere are two routes up the mountain:\n\nKarikachi Pass route\nSahoro Ski Resort route","","","","","","Mount Poroshiri (幌尻岳, Poroshiri-dake) or sometimes Mount Horoshiri is located in the Hidaka Mountains, Hokkaidō, Japan. Its name was derived from a phonetic kanji transcription of the Ainu words for \"great mountain\", poro-shiri. It is the highest mountain in the Hidaka range, and is one of the 100 famous mountains in Japan.","Mount Shokanbetsu (暑寒別岳, Shokanbetsu-dake) is the highest mountain of the Shokanbetsudake Mountains. It is located on the border between Hokuryū, Shintotsukawa and Mashike, Hokkaidō, Japan. The peak is also known as Mashike Fuji (増毛富士).","","may refer to","","","Mount Ashibetsu (芦別岳, Ashibetsu-dake) is a mountain located on the border between Ashibetsu and Furano, Hokkaidō, Japan. It is part of the Yūbari Mountains.","","","","Mount Tomamu (トマム山, Tomamu-san) is located in the Hidaka Mountains, Hokkaidō, Japan. It is the site of the Alpha Resort Tomamu, a ski resort.","Mount Memuro (芽室岳, Memuro-dake) is located in the Hidaka Mountains, Hokkaidō, Japan. The western summit of Mount Memuro (1746 m) is named Mount Pankenūshi.","may refer to","Mount Chiroro (チロロ岳, Chiroro-dake) is located in the Hidaka Mountains, Hokkaidō, Japan. Mount Chiroro's western summit (チロロ西峰, Chiroro-nishi-hō) has a height of 1,848 metres (6,063 ft).","Mount Pipairo (ピパイロ岳, Pipairo-dake) is located in the Hidaka Mountains, Hokkaidō, Japan.","Mount Tottabetsu (戸蔦別岳, Tottabetsu-dake) is located in the Hidaka Mountains, Hokkaidō, Japan.","Mount Poroshiri (幌尻岳, Poroshiri-dake) or sometimes Mount Horoshiri is located in the Hidaka Mountains, Hokkaidō, Japan. Its name was derived from a phonetic kanji transcription of the Ainu words for \"great mountain\", poro-shiri. It is the highest mountain in the Hidaka range, and is one of the 100 famous mountains in Japan.","","Mount Satsunai (札内岳, Satsunai-dake) is located in the Hidaka Mountains, Hokkaidō, Japan.","Mount Tokachiporoshiri (十勝幌尻岳, Tokachiporoshiri-dake) is located in the Hidaka Mountains, Hokkaidō, Japan.","","Mount Kamuiekuuchikaushi (カムイエクウチカウシ山, Kamuiekuuchikaushi-yama) is located in the Hidaka Mountains, Hokkaidō, Japan. It's one of the 200 Famous Japanese Mountains. The name is derived from Ainu languages which means \"the mountain which bears/gods tumble down.\" Climbers generally abbreviate it as Kamueku.It's the second highest peak only to the Mount Poroshiri in the Hidaka mountains, and its altitude is 1,979 m (6,493 ft) above sea level. The mountain is situated in the Hidaka-sanmyaku Erimo Quasi-National Park, and Triangulation station has been set up in the peak by Masaki Terunobu (正木照信) in 1900. A peak a little south east to the mountain is Pyramid peak (ピラミッド峰) which is 1,853 m (6,079 ft) above sea level shaped like a square pyramid, so that the Mount Kamuiekuuchikaushi can be the best viewing platform for the peak.","","Mount Petegari (ペテガリ岳, Petegari-dake) is located in the Hidaka Mountains, Hokkaidō, Japan.\n\n","Mount Nakano (中ノ岳, Nakano-dake) is a mountain in the Hokkaidō prefecture of Japan. It is located in the Hidaka Mountains range, and its peak is 1,519 meters above sea level.","may refer to","Pirika Nupuri (ピリカヌプリ, Pirika-nupuri) is a mountain located in the Hidaka Mountains, Hokkaidō, Japan.","Mount Rakko (楽古岳, Rakko-dake) is located in the Hidaka Mountains, Hokkaidō, Japan.","may refer to","Mount Apoi (アポイ岳, Apoi-dake) is located in the Hidaka Mountains, Hokkaidō, Japan. It is near the town of Samani. It is well known for hosting a large number of plants that are found only on Hokkaidō, such as Callianthemum miyabeanum (ヒダカソウ, Hidaka-sō). The mountain is made from ultramafic rock of unknown age.","Mount Moiwa (藻岩山, Moiwayama) is a mountain located about 5 km (3 mi) southwest of the center of Sapporo, Hokkaido and 6 km (4 mi) southwest of Sapporo Station. A ropeway and a motorway pass through Mt. Moiwa, and an observatory and a ski resort in winter make it a resort for Sapporo citizens and tourists.","","","","","","","Mount Eniwa (恵庭岳, Eniwa-dake) is an active volcano located in Shikotsu-Toya National Park in Hokkaidō, Japan. It sits opposite Mount Tarumae and Mount Fuppushi on the shores of Lake Shikotsu, the caldera lake that spawned the volcanoes. Mount Eniwa is the tallest of the three volcanoes.","Mount Fuppushi (風不死岳, Fuppushi-dake) is a dormant volcano located in Shikotsu-Toya National Park in Hokkaidō, Japan. It sits adjacent to Mount Tarumae and opposite Mount Eniwa. Mount Fuppushi is on the south shore of Lake Shikotsu, the caldera lake that spawned the volcanoes.\n\n","Mount Tarumae (樽前山, Tarumae-zan) is located in the Shikotsu-Toya National Park in Hokkaidō, Japan. It is located near both Tomakomai and Chitose towns and can be seen clearly from both. It is on the shores of Lake Shikotsu, a caldera lake. Tarumae is a 1,041 metre active andesitic stratovolcano, with a lava dome.","Mount Horohoro (ホロホロ山, Horohoro-yama) is a mountain in Hokkaidō. It is located on the border between Date and Shiraoi in Hokkaidō, Japan. It is the tallest mountain in the Iburi subprefecture. From the top you can see Lake Tōya, Lake Shikotsu, Mount Yōtei, Mount Eniwa, and even the outskirts of Sapporo.","","Mount Tengu (天狗岳, Tengu-dake) is a 2,646m mountain on the border of Chino and Koumi of Nagano in Japan. This mountain is the highest mountains of Northern Yatsugatake Volcanic Group. Named for the mythical avian creatures of Japanese folklore, the Tengu.","","Mount Mekunnai (目国内岳, Mekunnai-dake) is an andesitic volcano in the Mount Raiden Volcanic Group on the border between Iwanai and Rankoshi, Hokkaidō, Japan. Mount Mekunnai is a pyroclastic cone. The mountain consists of primarily non-alkali, mafic, volcanic rock. The rock is younger than that of neighboring Mount Raiden, being categorized at 700,000 to 13,000 years old. The rock is older than that of the Niseko Volcanic Group.","","","Mount Shiribetsu (Japanese: 尻別岳) is a volcano on the Japanese island of Hokkaido. The volcano last erupted hundreds of thousands of years before present.","","","","","","","","Mount Kenashi (毛無山, Kenashi-yama, lit. \"bald mountain\") is the name for numerous mountains in Japan.\n\nMount Kenashi (Otaru), a 548 m (1,798 ft) mountain in Otaru, Hokkaidō\nMount Kenashi (Yoichi), a 650 m (2,133 ft) mountain on the border of Otaru and Yoichi, Hokkaidō\nMount Kenashi (Setana), a 816 m (2,677 ft) mountain in Setana, Hokkaidō\nMount Kenashi (Hakodate), a 631 m (2,070 ft) mountain in Hakodate, Hokkaidō\nMount Kenashi (Akita), a mountain in Akita Prefecture\nMount Kenashi (Niigata), a mountain in Niigata Prefecture\nMount Kenashi (Nagano), a mountain in Iiyama, Nagano Prefecture\nMount Kenashi (Yamanashi), a 1,500 m (4,921 ft) mountain in Yamanashi Prefecture\nMount Kenashi (Yamanashi, Shizuoka), a 1,946 m (6,385 ft) mountain in Yamanashi and Shizuoka prefectures\nMount Kenashi (Tottori), a 570.5 m (1,872 ft) mountain in Tottori Prefecture\nMount Kenashi (Okayama, Tottori), a mountain in Okayama and Tottori prefectures\nMount Kenashi (Hiroshima), a mountain in Hiroshima Prefecture\nMount Kenashi (Shimane), a 1,062 m (3,484 ft) mountain in Shimane Prefecture","","","may refer to","","Mount E (恵山, E-san) is an active stratovolcano of the Kameda peninsula, which is itself part of the larger Oshima Peninsula. It is located in the rural, eastern region of Hakodate, Hokkaido, Japan. Mount E is part of Esan Prefectural Natural Park.","Mount Hakodate (函館山, Hakodate-yama) is a mountain in Hakodate, Hokkaidō, Japan.\nThe mountain is renowned for its view of the surrounding bay and city. The Michelin Green Guide: Japan gave the experience 3/3 stars in a review, placing it as equal to mountain views of Naples and Hong Kong.\nThe peak is accessible by hiking or by bike, as well as by a regular cable car service.","","","","Mount Daisengen (大千軒岳, Daisengen-dake) is a 1,072-metre (3,517 ft) mountain located on the Oshima Peninsula of Hokkaidō, Japan. Mount Daisengen is the tallest mountain in the southern region of the peninsula.A gold mine was established on the mountain during the Edo period, and a group of 106 Japanese Christians were executed on the mountain by the Matsumae clan during the nationwide crackdown on Christianity.\nSeveral climbing routes exist.","","may refer to","","Mount Hiuchi (火打山, Hiuchi-yama) is one of the 100 Famous Japanese Mountains, reaching the height of 2,462 m (8,077 ft). It is situated in Japan's Kubiki Mountains in Niigata Prefecture. It was specified for Jōshin'etsu Kōgen National Park on July 10, 1956, but since has been absorbed by the Togakushi-Renzan National Park, which encompasses Mount Myōkō (妙高山 Myōkō-san) and Mount Niigata-Yake (新潟焼山 Niigata-Yakeyama).","","","","","","Mount Bonju (梵珠山, Bonju-san) is a mountain located between Namioka, Aomori and Goshogawara, Japan near the southern end of the Tsugaru Mountains between the central part of Aomori and Goshogawara. The mountain lies within the Mount Bonju Prefectural Forest. Its peak lies within the city of Aomori. It has an elevation of 468 meters (1,535 ft).","","","","","","","Mount Himekami (Japanese: 姫神山, Himekami-san) is a mountain in Morioka, Iwate Prefecture, Japan. It lends its name to the band Himekami.\nMt. Himekami is about 20 kilometres (12 mi) north of urban Morioka and features alpine flora and views of Mount Iwate. A relatively easy hike to its summit is practicable from April to November.","","","","","Mount Hayachine (早池峰山, Hayachine-san) is the highest mountain in the Kitakami Range, located in the Tōhoku region of northern Honshū, Japan. With an elevation of 1,917 m (6,289 ft), it is the second highest in Iwate Prefecture after Mount Iwate. Mount Hayachine is mentioned in 100 Famous Japanese Mountains, a book written in 1964 by Kyūya Fukada. The mountain is on the borders of the municipalities  of Hanamaki, Tōno, and Miyako, east of the prefectural capital of Morioka.","Mount Yakushi (薬師岳, Yakushi-dake) is one of the 100 Famous Japanese Mountains, reaching the height of 2,926 m (9,600 ft). It is situated in Japan's Hida Mountains in Toyama Prefecture. It was specified for Chūbu-Sangaku National Park on December 4, 1934.","","","","","","","","Mount Kinka (金華山, Kinkazan, Kinkasan) refers to one of two mountains in Japan:\n\nMount Kinka (Gifu), located in Gifu, Gifu Prefecture, formerly known as Mount Inaba\nMount Kinka (Miyagi), located on the island of Kinkasan in Miyagi Prefecture","The Hakkōda Mountains (八甲田山系, Hakkōda-sankei) are an active volcanic complex in south-central Aomori Prefecture, Japan, in Towada-Hachimantai National Park. Often called Mount Hakkōda (八甲田山, Hakkōda-san) or simply Hakkōda (八甲田), the mountains are collectively listed as one of the 100 Famous Japanese Mountains. Its highest peak, Mount Ōdake, lies 21.3 kilometers (13.2 mi) southeast of central Aomori and 28 kilometers (17 mi) west of central Towada and has an elevation of 1,585 meters (5,200 ft). The Hakkōda Mountains are a part Ōu Mountains which make up part of the Northeastern Japan Arc, a segment of the Pacific Ring of Fire. The volcanic complex consists of fourteen stratovolcanoes and lava domes arranged into two volcanic groups. The Northern Hakkōda Volcanic Group emerges from the rim of an 8-kilometer-wide (5.0 mi) caldera that dates back to the Pleistocene. The Southern Hakkōda Volcanic Group predates the caldera.\nThe Hakkōda Mountains attract many climbers, skiers, and sightseers. The mountains offer extensive backcountry skiing in the winter and early spring. There is a lift, the Hakkōda Ropeway in the northern Hakkōda Mountains used by visitors year-round and several hiking trails cross the mountains. While the trails do not pose any technical climbing challenges, Hakkōda presents dangers such as volcanic gases, harsh winter weather, and avalanches. The most notable incident in mountains' history was the Hakkōda Mountains incident, the worst mountaineering accident in modern history.","The Hakkōda Mountains (八甲田山系, Hakkōda-sankei) are an active volcanic complex in south-central Aomori Prefecture, Japan, in Towada-Hachimantai National Park. Often called Mount Hakkōda (八甲田山, Hakkōda-san) or simply Hakkōda (八甲田), the mountains are collectively listed as one of the 100 Famous Japanese Mountains. Its highest peak, Mount Ōdake, lies 21.3 kilometers (13.2 mi) southeast of central Aomori and 28 kilometers (17 mi) west of central Towada and has an elevation of 1,585 meters (5,200 ft). The Hakkōda Mountains are a part Ōu Mountains which make up part of the Northeastern Japan Arc, a segment of the Pacific Ring of Fire. The volcanic complex consists of fourteen stratovolcanoes and lava domes arranged into two volcanic groups. The Northern Hakkōda Volcanic Group emerges from the rim of an 8-kilometer-wide (5.0 mi) caldera that dates back to the Pleistocene. The Southern Hakkōda Volcanic Group predates the caldera.\nThe Hakkōda Mountains attract many climbers, skiers, and sightseers. The mountains offer extensive backcountry skiing in the winter and early spring. There is a lift, the Hakkōda Ropeway in the northern Hakkōda Mountains used by visitors year-round and several hiking trails cross the mountains. While the trails do not pose any technical climbing challenges, Hakkōda presents dangers such as volcanic gases, harsh winter weather, and avalanches. The most notable incident in mountains' history was the Hakkōda Mountains incident, the worst mountaineering accident in modern history.","","","","Mount Naka (中岳, Naka-dake) is a mountain with an altitude of 3,084m located in the southern part of the Hida Mountains, which straddles Matsumoto in Nagano Prefecture and Takayama in Gifu Prefecture. This mountain is located in Chūbu-Sangaku National Park.","","","","","Mount Yake (焼岳, Yake-dake) literally, \"Burning mountain\" is an active volcano in the Hida Mountains, lying between Matsumoto, Nagano Prefecture, and Takayama, Gifu Prefecture, Japan. It is one of the 100 Famous Japanese Mountains, reaching 2,455 m (8,054 ft) at the highest peak.","Mount Hachimantai (八幡平, Hachimantai) is the highest peak of a group of stratovolcanos distributed around the Hachimantai plateau in the Ōu Mountains in northern Honshū, Japan. This volcanic plateau is part of the Nasu Volcanic Zone and straddles the border between the Iwate Prefecture and Akita Prefecture. The volcano is listed as one of the 100 Famous Japanese Mountains, and forms part of the Towada-Hachimantai National Park.","Mount Hachimantai (八幡平, Hachimantai) is the highest peak of a group of stratovolcanos distributed around the Hachimantai plateau in the Ōu Mountains in northern Honshū, Japan. This volcanic plateau is part of the Nasu Volcanic Zone and straddles the border between the Iwate Prefecture and Akita Prefecture. The volcano is listed as one of the 100 Famous Japanese Mountains, and forms part of the Towada-Hachimantai National Park.","Mount Hachimantai (八幡平, Hachimantai) is the highest peak of a group of stratovolcanos distributed around the Hachimantai plateau in the Ōu Mountains in northern Honshū, Japan. This volcanic plateau is part of the Nasu Volcanic Zone and straddles the border between the Iwate Prefecture and Akita Prefecture. The volcano is listed as one of the 100 Famous Japanese Mountains, and forms part of the Towada-Hachimantai National Park.","","{{Short description|Stratovolcano on the island of Honshu, Japan]]\n\nMount Iwate (岩手山, Iwate-san) is a stratovolcano complex in the Ōu Mountains of western Iwate Prefecture, in the Tōhoku region of northern Honshū,  Japan. With an elevation of 2,038 metres (6,686 ft), it is the highest in Iwate Prefecture.  It is included as one of the 100 famous mountains in Japan, a book composed in 1964 by mountaineer and author Kyūya Fukada. The mountain is on the borders of the municipalities  of Hachimantai, Takizawa, and Shizukuishi, west of the prefectural capital of Morioka. Much of the mountain is within the borders of the Towada-Hachimantai National Park. The mountain is also referred to as the \"Nanbu Fuji\" for its resemblance to Mount Fuji.","Mount Eboshi (烏帽子岳, Eboshi-dake) is a stratovolcano located in the Daisetsuzan Volcanic Group of the Ishikari Mountains, Hokkaidō, Japan.\n\n","may refer to","Mount Iwaki (岩木山, Iwaki-san) is a stratovolcano located in western Aomori Prefecture, Tohoku, Japan. It is also referred to as Tsugaru Fuji (津軽富士) and less frequently, Okufuji (奥富士) due to its similar shape to Mount Fuji. With a summit elevation of 1,625 meters (5,331 ft) and a prominence of 1,322 meters (4,337 ft) it is the highest mountain in Aomori Prefecture.\nMount Iwaki is listed as one of the 100 Famous Japanese Mountains in a 1964 book by mountaineer and author Kyūya Fukada. The mountain and its surroundings are located within the borders of Tsugaru Quasi-National Park.","","Mount Shirakami (白髪山, Shirakami-yama) is a 721.4 meter high mountain in Sasayama, Hyōgo, Japan. Another name is Tanba-Fuji, literally, \"Mount Fuji in Tanba Province\". This mountain is one of the Hyōgo 50 mountains, and Kinki 100 mountains.","","may refer to","","","","","","","","","","","","","","","","","Mount Yakeishi (jp: 焼石岳) is a mountain in the Ōu Mountains on Honshu, Japan. The mountain, which rises to a height of 1548 meters, is part of Kurikoma Quasi-National Park.","","","","","","Mount Hiuchi (火打山, Hiuchi-yama) is one of the 100 Famous Japanese Mountains, reaching the height of 2,462 m (8,077 ft). It is situated in Japan's Kubiki Mountains in Niigata Prefecture. It was specified for Jōshin'etsu Kōgen National Park on July 10, 1956, but since has been absorbed by the Togakushi-Renzan National Park, which encompasses Mount Myōkō (妙高山 Myōkō-san) and Mount Niigata-Yake (新潟焼山 Niigata-Yakeyama).","","","","","","","Mount Funagata (船形山, Funagata-yama) is a mountain within the Ōu Mountains on the border of Miyagi Prefecture and Yamagata Prefecture in the Tōhoku region of northern Japan. It is listed as one of the \"200 famous mountains of Japan\" and has a height of 1,500.34 metres (4,922.4 ft). The mountain is also known as Mount Goshō (御所山, Gosho-yama) when viewed from Yamagata prefecture.","","","","","","","","","","Mt. Shinobu (信夫山, Shinobu-yama) is a 275-meter monadnock  located in the center of Fukushima, Fukushima, Japan.","","","","","","","","Mount Adatara (安達太良山, Adatara-yama) is a stratovolcano in Fukushima Prefecture, Japan.\nIt is located about 15 kilometres southwest of the city of Fukushima and east of Mount Bandai. Its last known eruption was in 1996. An eruption in 1900 killed 72 workers at a sulfur mine located in the summit crater.","Mount Adatara (安達太良山, Adatara-yama) is a stratovolcano in Fukushima Prefecture, Japan.\nIt is located about 15 kilometres southwest of the city of Fukushima and east of Mount Bandai. Its last known eruption was in 1996. An eruption in 1900 killed 72 workers at a sulfur mine located in the summit crater.","Mount Bandai (磐梯山, Bandai-san) is a stratovolcano located in Inawashiro-town, Bandai-town, and Kitashiobara village, in Yama-Gun, Fukushima prefecture. It is an active stratovolcano located to the north of Lake Inawashiro. Mount Bandai, including the Bandai heights, belongs to the Bandai-Asahi National Park.\nThe altitude of the triangulation station “Bandai”, installed in 1904, had been employed as the official altitude of Mount Bandai. However, after the station disappeared due to erosion, it was re-measured in October 2010 and now is 1,816.29m. The name “Mount Bandai” is used to refer to the main peak “Bandai”, along with several other peaks including Akahani at 1,430m and Kushigamine at 1,636m, created during the 1888 eruption of Mount Bandai.\nMount Bandai was originally called “Iwahashi-yama” which means “a rock ladder to the sky”. It is now sometimes called “Aizu Fuji” and “Aizu Bandai”.  The south foot is called Omotebandai and the north foot is called Urabandai. When seen from Omotebandai, the mountain looks very tidy, but when viewed from Urabandai the mountain shows a wild shape, due to its collapse.\nIt is one of the list of the 100 famous mountains in Japan. In 2007, the mountain was selected as one of the top 100 geographic landmarks in Japan. Additionally, in 2011 the mountain was certified as a geopark of Japan.","","","Mount Haguro (羽黒山, Haguro-san) is one of the  Three Mountains of Dewa in the city of Tsuruoka, the ancient province of Dewa (a domain consisting of modern-day Yamagata Prefecture and Akita Prefecture), Japan. As the lowest of the three mountains, standing at 414 m (1,358 ft), it is the only one that is accessible throughout the year.\nA path of 2,446 stone steps leads to its summit amidst 600-year-old sugi trees, past the famous Gojūnotō (五重塔) five story pagoda, Grandpa cedar (jijisugi 爺杉), the 1000 years old cedar tree, and numerous shrines. The steps and the pagoda are listed as National Treasures. Sanjingōsaiden shrine (三神合祭殿) at the summit venerates the spirits of all three mountains.\nThe summit can also be reached by bus service.  In addition to religious pilgrims, travellers often stay at the Saikan temple lodgings.","","","","Mount Maya (摩耶山, Maya-san) is a 698.6-metre-high (2,292 ft) mountain in Kobe, Hyōgo Prefecture, Japan. This mountain is one of the major peaks of the Rokkō Mountains, and is the most popular peak for visitors on the West-Rokkō Mountains.","","Mount Asahi can refer to:\n\nAsahidake, the tallest mountain of Hokkaidō\nMount Asahi (Ishikari), a hill outside Asahikawa, Hokkaidō\nMount Asahi (Yamagata)","","","","","","","Mount Iide (飯豊山, Iide-san) is the main peak of the Iide mountain range that spans the Fukushima, Niigata and Yamagata prefectures in Japan. On top of the mountain stands the Mount Iide Shrine (飯豊山神社). Mount Iide is, together with the rest of the range, one of the mountains described in Kyūya Fukada's book 100 Famous Japanese Mountains.Mount Iide is located at 2105 m above sea level but is not the highest peak of the Iide mountain range even though it is the main peak of the range. The highest is Mount Dainichi (大日岳, Dainichi-dake) that is 2128 m high.The mountain is located on the border between Niigata prefecture and Yamagata prefecture, but the summit itself, Mount Iide Shrine and a path roughly one meter wide leading there belongs to Kitakata, Fukushima. This was a response to complaints when Higashikanbara District was transferred from Fukushima to Niigata during the Meiji period. As a result, Fukushima prefecture has an uneven border, with an arm stretching through the Iide mountain range up to the Mount Iide Shrine.","Mount Dainichi (大日ヶ岳, Dainichi-ga-take) is a mountain located in the cities of Gujō and Takayama in Gifu Prefecture, Japan. It is part of the Ryōhaku Mountains and has a height of 1,709 m (5,607 ft). The rain that falls on the mountain flows into three rivers: the Nagara River, the Shō River and the Kuzuryū River.","","","","","","","","","","","","","Mount Nantai (男体山, Nantai-san) literally \"man's body mountain\", also called Futara-san (二荒山) is a stratovolcano in the Nikkō National Park in Tochigi Prefecture, on central Honshū, the main island of Japan. It stands at 2,486 m high. A prominent landmark, it can be seen on clear days from as far as the Pacific coast, 100 km away.","","Mount Yamizo (Japanese: 八溝山（やみぞさん）, Hepburn: yamizosan) is a mountain and it stretches Ibaraki Prefecture with Fukushima in Japan. Mount Yamizo is the highest mountain in Ibaraki Prefecture.","","Kaba, a twin volcano with Mount Hitam in Bengkulu Province of Indonesia, has an elongated summit crater complex dominated by three large historically active craters trending ENE from the summit to the upper NE flank. The SW-most crater of Gunung Kaba, Kawah Lama, is the largest. Most historical eruptions have affected only the summit region of the volcano. They mostly originated from the central summit craters, although the upper-NE flank crater Kawah Vogelsang also produced explosions during the 19th and 20th centuries. In 1833 an eruption ejected water from the crater lake, forming lahars that produced damage and fatalities at Talang, Klingi, and Bliti villages.","Mount Tsukuba (筑波山, Tsukuba-san) is an 877 m (2,877 ft) mountain located near Tsukuba, Japan.  It is one of the most famous mountains in Japan, particularly well known for its double peaks, Nyotai-san (女体山, lit. \"female body\") 877 m (2,877 ft) and Nantai-san (男体山, lit. \"male body\") 871 m (2,858 ft). Many people climb the so-called \"purple mountain\" every year for the panoramic view of the Kantō plain from the summit. On clear days  the Tōkyō skyline, Lake Kasumigaura and even Mount Fuji are visible from the summit. Japanese mountains are mostly volcanic, but Mount Tsukuba is non-volcanic granite and gabbro in origin.  Renowned beautiful granites are produced in the northern quarries even today.","","Mount Nasu (那須岳, Nasu-dake) is a group of complex volcanoes located in the northeast part of Nikkō National Park, Japan. The tallest peak is Sanbonyari Peak at a height of  1,916.9 m (6,289 ft). Mount Nasu is one of the 100 Famous Japanese Mountains.","","","","","","","","Mount Nantai (男体山, Nantai-san) literally \"man's body mountain\", also called Futara-san (二荒山) is a stratovolcano in the Nikkō National Park in Tochigi Prefecture, on central Honshū, the main island of Japan. It stands at 2,486 m high. A prominent landmark, it can be seen on clear days from as far as the Pacific coast, 100 km away.","","Mount Sukai (皇海山, Sukai-san) is one of the 100 Famous Japanese Mountains. The 2,144-metre-high (7,034 ft) peak lies in the Ashio Mountains of Japan, on the border of Nikkō in Tochigi Prefecture and Numata in Gunma Prefecture. Mount Sukai is an old stratovolcano, but with the whole mountain covered in forest today it does not appear like a typical volcano.","","","","Mount Akagi (赤城山, Akagi-yama, Red Castle) is a mountain in Gunma Prefecture, Japan.\nThe broad, low dominantly andesitic stratovolcano rises above the northern end of the Kanto Plain. It contains an elliptical, 3 x 4 km summit caldera with post-caldera lava domes arranged along a NW-SE line. Lake Ono is located at the NE end of the caldera. An older stratovolcano was partially destroyed by edifice collapse, producing a debris-avalanche deposit along the south flank. A series of large plinian eruptions accompanied growth of a second stratovolcano during the Pleistocene. Construction of the central cone in the late-Pleistocene summit caldera began following the last of the plinian eruptions about 31,000 years ago. During historical time unusual activity was recorded on several occasions during the 9th century, but reported eruptions in 1251 and 1938 are considered uncertain.Mount Akagi, along with Mount Myōgi and Mount Haruna, is one of the \"Three Mountains of Jōmō\" (上毛三山), and the cold north winds down from it are called Akagi-oroshi (赤城おろし) or Karakkaze (空っ風).\nThe Amagi-class battlecruiser, converted into an Aircraft Carrier during construction, Akagi was named after Mount Akagi and was the flagship for the strike force commanded by Vice Admiral Chuichi Nagumo in the attack on Pearl Harbor. The carrier was later sunk in the Battle of Midway.","Mount Akagi (赤城山, Akagi-yama, Red Castle) is a mountain in Gunma Prefecture, Japan.\nThe broad, low dominantly andesitic stratovolcano rises above the northern end of the Kanto Plain. It contains an elliptical, 3 x 4 km summit caldera with post-caldera lava domes arranged along a NW-SE line. Lake Ono is located at the NE end of the caldera. An older stratovolcano was partially destroyed by edifice collapse, producing a debris-avalanche deposit along the south flank. A series of large plinian eruptions accompanied growth of a second stratovolcano during the Pleistocene. Construction of the central cone in the late-Pleistocene summit caldera began following the last of the plinian eruptions about 31,000 years ago. During historical time unusual activity was recorded on several occasions during the 9th century, but reported eruptions in 1251 and 1938 are considered uncertain.Mount Akagi, along with Mount Myōgi and Mount Haruna, is one of the \"Three Mountains of Jōmō\" (上毛三山), and the cold north winds down from it are called Akagi-oroshi (赤城おろし) or Karakkaze (空っ風).\nThe Amagi-class battlecruiser, converted into an Aircraft Carrier during construction, Akagi was named after Mount Akagi and was the flagship for the strike force commanded by Vice Admiral Chuichi Nagumo in the attack on Pearl Harbor. The carrier was later sunk in the Battle of Midway.","","","","","","","","","Mount Asahi can refer to:\n\nAsahidake, the tallest mountain of Hokkaidō\nMount Asahi (Ishikari), a hill outside Asahikawa, Hokkaidō\nMount Asahi (Yamagata)","","may refer to","Mount Hiragatake (平ヶ岳, Hira-ga-take) is one of the 100 Famous Japanese Mountains. It lies on the border between Gunma and Niigata prefectures.","","Hiuchi, also Hiuchigatake (Japanese: 燧ヶ岳) is a 2,356m tall stratovolcano mountain in Oze National Park, and located in Hinoemata Village, Minami-Aizu gun, Fukushima Prefecture, Japan. This is the highest mountain in Tōhoku region.  The volcano rises in the north of Lake Ozenuma. It is one of the 100 Famous Japanese Mountains.","Mount Shibutsu (至仏山 Shifutsu/Shibutsu-san) is a serpentine mountain in the north-east of Gunma Prefecture in Japan. It is 2,228.1 m (7,310 ft) tall and located between Minakami Machi and Katashina Villages. It's one of the 100 Famous Japanese Mountains and is home to a \"treasure trove\" of alpine plants. It is part of Oze National Park and the Minakami UNESCO Eco Park.","may refer to","","","","","","","","may refer to","","Mount Nakano (中ノ岳, Nakano-dake) is a mountain in the Hokkaidō prefecture of Japan. It is located in the Hidaka Mountains range, and its peak is 1,519 meters above sea level.","","","Mount Makihata (巻機山, Makihata-yama) is a mountain located on the border between Niigata Prefecture and Gunma Prefecture in Japan. The mountain is listed as one of the 100 Famous Japanese Mountains in a 1964 book by mountaineer/author Kyūya Fukada. It has a peak elevation of 1,967 meters (6,453 ft).","","Mount Asahi can refer to:\n\nAsahidake, the tallest mountain of Hokkaidō\nMount Asahi (Ishikari), a hill outside Asahikawa, Hokkaidō\nMount Asahi (Yamagata)","Mount Asahi can refer to:\n\nAsahidake, the tallest mountain of Hokkaidō\nMount Asahi (Ishikari), a hill outside Asahikawa, Hokkaidō\nMount Asahi (Yamagata)","Mount Tanigawa (谷川岳, Tanigawa-dake) is a 1,977 m (6,486 ft) mountain on the border of Gunma Prefecture and Niigata Prefecture in Japan. It is one of the 100 famous mountains in Japan.","Mount Tanigawa (谷川岳, Tanigawa-dake) is a 1,977 m (6,486 ft) mountain on the border of Gunma Prefecture and Niigata Prefecture in Japan. It is one of the 100 famous mountains in Japan.","Mount Tanigawa (谷川岳, Tanigawa-dake) is a 1,977 m (6,486 ft) mountain on the border of Gunma Prefecture and Niigata Prefecture in Japan. It is one of the 100 famous mountains in Japan.","","","Mount Azumaya (四阿山, Azumaya-san) is one of the 100 Famous Japanese Mountains. The 2,354-metre-high (7,723 ft) peak lies on the border of Nagano Prefecture and Gunma Prefecture. There exist alternative spellings of the mountain's name, like: 吾妻山 and 吾嬬山 which is read as \"Agatsuma-yama\" (Mount Agatsuma). In the village Tsumagoi, the mountain is spelled 吾妻山.\nThe mountain should not be confused with Mount Azumaya (四阿屋山, Azumaya-san) of which there are two, one in Nagano Prefecture and the other in Saitama Prefecture. Though the reading is the same, the name written in Kanji differs from the mountain in this article.","Mount Naeba (苗場山, Naeba-san) is a stratovolcano on the border of Nagano and Niigata prefectures in central Honshū, Japan. It is about 200 km (124 mi) from Tokyo. It was active between 200,000 and 800,000 years ago. It is made of primarily andesite.","","","","","","","","","","","","Mount Azumaya (四阿山, Azumaya-san) is one of the 100 Famous Japanese Mountains. The 2,354-metre-high (7,723 ft) peak lies on the border of Nagano Prefecture and Gunma Prefecture. There exist alternative spellings of the mountain's name, like: 吾妻山 and 吾嬬山 which is read as \"Agatsuma-yama\" (Mount Agatsuma). In the village Tsumagoi, the mountain is spelled 吾妻山.\nThe mountain should not be confused with Mount Azumaya (四阿屋山, Azumaya-san) of which there are two, one in Nagano Prefecture and the other in Saitama Prefecture. Though the reading is the same, the name written in Kanji differs from the mountain in this article.","Mount Azumaya (四阿山, Azumaya-san) is one of the 100 Famous Japanese Mountains. The 2,354-metre-high (7,723 ft) peak lies on the border of Nagano Prefecture and Gunma Prefecture. There exist alternative spellings of the mountain's name, like: 吾妻山 and 吾嬬山 which is read as \"Agatsuma-yama\" (Mount Agatsuma). In the village Tsumagoi, the mountain is spelled 吾妻山.\nThe mountain should not be confused with Mount Azumaya (四阿屋山, Azumaya-san) of which there are two, one in Nagano Prefecture and the other in Saitama Prefecture. Though the reading is the same, the name written in Kanji differs from the mountain in this article.","","","Mount Asama (浅間山, Asama-yama, literally translated as 'shallow mountain') is an active complex volcano in central Honshū, the main island of Japan. The volcano is the most active on Honshū. The Japan Meteorological Agency classifies Mount Asama as rank A. It stands 2,568 metres (8,425 ft) above sea level on the border of Gunma and Nagano prefectures. It is included in 100 Famous Japanese Mountains.","","","Mount Haruna (榛名山, Haruna-san) is a dormant stratovolcano in Gunma, eastern Honshū, Japan.","Mount Komochi (子持山, Komochi-yama) is a volcano in Gunma Prefecture, Japan. Its elevation is 4,252 ft (1,296 m) and its prominence is 1,936 ft (590 m).","","","","","Mount Futago (69°12′S 39°44′E) is a small mountain with two peaks, the northern one being 240 metres (790 ft) and the southern one 245 metres (800 ft) high, in the northern part of the Langhovde Hills, Queen Maud Land, Antarctica. It was mapped from surveys and air photos by the Japanese Antarctic Research Expedition (JARE), 1957–62. The name Futago-yama (Hutago Yama), meaning \"twin mountain,\" was given by JARE Headquarters in 1972.","","Mount Ogura (御座山, Ogura-san) is a mountain located between Kitaaiki and Minamiaiki Villages, Minamisaku District, Nagano Prefecture, Japan.  With its summit being 2,112 meters above sea level, it is the tallest mountain in Minamiaiki, Nagano.\nIt is known for the Japanese rhododendron flowers (shakunage in Japanese) that come into full bloom in early to mid-June.","","","","Mount Mizugaki (瑞牆山 Mizugaki-san) is a mountain located in Hokuto-city, in the Yamanashi Prefecture, within Chichibu-Tama-Kai National Park. It is one of the 100 Famous Japanese Mountains. It is part of the Okuchichibu Mountains. It has an altitude of 2230m. The mountain is located just across from Mt. Kinpu/Kinpō.\nThe mountain is composed mainly of granite, and has beautiful flowers in summer. Mt. Mizugaki has a unique shape consisting of a number of granite rocks, strangely shaped rocks and huge rocks that is opposite to Chichibu mountains covered with rich woods. The view from the peak is magnificent and hiking routes are in good condition. Many hikers walk here especially in the seasons of fresh green and autumn leaves.","Mount Kinpu (金峰山, Kinpu-san),  or Mount Kinpō (金峰山, Kinpō-san) is a mountain of the Okuchichibu Mountains, and located on the boundary of Nagano Prefecture and Yamanashi Prefecture, Japan.\nIt is one of the 100 Famous Japanese Mountains. At 2599m tall, it is the second highest peak of the Okuchichibu Mountains.","Mount Asahi can refer to:\n\nAsahidake, the tallest mountain of Hokkaidō\nMount Asahi (Ishikari), a hill outside Asahikawa, Hokkaidō\nMount Asahi (Yamagata)","","","","","","","","","","","Mount Kumotori (雲取山, Kumotori-san) stands at the boundary of Tokyo, Saitama, and Yamanashi Prefectures on the island of Honshū, Japan. With an elevation of 2,017 metres (6,617 ft), its summit is the highest point in Tokyo. It separates the Okutama Mountains and the Okuchichibu Mountains. While it marks the end of the Ishione (石尾根) mountain ridge that begins near the JR Oku-Tama Station, the highest mountain ridge in Tokyo, its remote location amongst a group of mountains from both mountain ranges makes access difficult.\n\nKumotori-san features an \"emergency\" hut sometimes used by hikers as overnight shelter. Hikers not used to the altitude (if coming from Tokyo) may prefer overnighting at a lower elevation. The top of Kumotori-san, in good weather, offers a splendid view of Mount Fuji.\nThe prominence of the mountain in the region resulted in its summit being established as a fixed first-class triangulation point. As the triangulation point was established in December 1882, this was also one of the earliest ones established in Japan.\n\nKumotori is one of the 100 Famous Mountains of Japan.","","","","","","","","","","","","Mount Jinba (陣馬山, Jinba-san) is located between Hachiōji, Tokyo and Fujino, Kanagawa Prefecture. Its peak is roughly 857 m (2,812 ft) above sea level.","Mount Takao (高尾山, Takao-san) is a mountain in the city of Hachiōji, Tokyo, Japan. It is protected within Meiji no Mori Takao Quasi-National Park.\nStanding 599 metres (1,965 ft) tall and located within an hour of downtown Tokyo, it is a popular hiking spot, with eight hiking courses and more than 2.5 million annual visitors. The Tama Forest Science Garden is also located at the mountain's base.\nMount Takao is closely associated with the Shinto-Buddhist tengu, minor kami from Japanese folklore, and the daitengu Naigubu. The mountain is also renowned for Shugendō, the mountain asceticism focusing on strict discipline. A Buddhist temple, Takaosan Yakuōin Yūkiji, is located on the mountain, and attracts many visitors who pray to the tengu for good fortune. The temple belongs to the Shingon Buddhist sect.","","","Mount Nokogiri can refer to:\n\nMount Nokogiri (Chiba) (Nokogiriyama), a mountain in Honshū, Japan.\nMount Nokogiri (Hokkaidō) (Nokogiridake), a mountain in Hokkaidō, Japan.\nMount Nokogiri (Akaishi) (Nokogiridake), in the Akaishi Mountains, forming part of the boundary between Nagano and Yamanashi Prefectures","Mount Tomi (富山, Tomi-san) is a mountain on the border of the city of Minamibōsō, in southern Chiba Prefecture. The mountain is formed by two peaks. The north, called Konpira Peak, is 349.5 m (1,147 ft), and the south, called Kannon Peak, is 342 m (1,122 ft). Mount Tomi is one of the\nmountains of the Mineoka Mountain District of the Bōsō Hill Range.","Mount Iyogatake (伊予ヶ岳, Iyoga-take) is a mountain on the border of the city of Minamibōsō, Chiba Prefecture, Japan with an altitude of 336.6 m (1,104 ft). Mount Iyogatake is at the west of the Mineoka Mountain District of the Bōsō Hill Range, in close proximity to Mount Tomi. The mountain takes its name from its resemblance to Mount Ishizuchi in Ehime Prefecture, formerly in Iyo Province.\nMount Iyogatake is one of the few mountains in the Bōsō Hill Range with steep rock cliff. It can be easily climbed within 40 minutes. The entrance to the path of the mountain is between Heguri Elementary School and the Heguri Tenjin Shrine. Mount Iyogatake offers a clear view of the other mountains of the Bōsō Hill Range and Tokyo Bay, and on clear days Mount Fuji and the Izu Islands are also visible.Mount Iyogatake and the Heguri Tenjin Shrine are associated with a legend of a tengu, a supernatural creature found in Japanese folklore.","Mount Atago is a very common name for peaks all over Japan.\nMount Atago (愛宕山, Atago-yama/san) is a 924m mountain in the northwestern part of Ukyo-ku, in the city of Kyoto, Kyoto Prefecture, Japan.  The Atago Shrine is located on the top of the mountain.","","","","Mount Tanzawa (丹沢山, Tanzawa-san, -yama) is a mountain of the Tanzawa Mountains, with an elevation of 1,567.1 metres (5,141 ft). Its summit marks the border between Sagamihara,  Kiyokawa  in Aikō District, and Yamakita in Ashigarakami District.","Mount Tanzawa (丹沢山, Tanzawa-san, -yama) is a mountain of the Tanzawa Mountains, with an elevation of 1,567.1 metres (5,141 ft). Its summit marks the border between Sagamihara,  Kiyokawa  in Aikō District, and Yamakita in Ashigarakami District.","Mount Tanzawa (丹沢山, Tanzawa-san, -yama) is a mountain of the Tanzawa Mountains, with an elevation of 1,567.1 metres (5,141 ft). Its summit marks the border between Sagamihara,  Kiyokawa  in Aikō District, and Yamakita in Ashigarakami District.","","","","","","","","Mount Fuji (富士山, Fujisan, Japanese: [ɸɯꜜ(d)ʑisaɴ] (listen)), located on the island of Honshū, is the highest mountain in Japan, standing 3,776.24 m (12,389.2 ft). It is the second-highest volcano located on an island in Asia (after Mount Kerinci on the island of Sumatra), and seventh-highest peak of an island on Earth. Mount Fuji is an active stratovolcano that last erupted from 1707 to 1708. The mountain is located about 100 km (62 mi) southwest of Tokyo and is visible from there on clear days. Mount Fuji's exceptionally symmetrical cone, which is covered in snow for about five months of the year, is commonly used as a cultural icon of Japan and it is frequently depicted in art and photography, as well as visited by sightseers and climbers.Mount Fuji is one of Japan's \"Three Holy Mountains\" (三霊山, Sanreizan) along with Mount Tate and Mount Haku. It is a Special Place of Scenic Beauty and one of Japan's Historic Sites. It was added to the World Heritage List as a Cultural Site on June 22, 2013. According to UNESCO, Mount Fuji has \"inspired artists and poets and been the object of pilgrimage for centuries\". UNESCO recognizes 25 sites of cultural interest within the Mount Fuji locality. These 25 locations include the mountain and the Shinto shrine, Fujisan Hongū Sengen Taisha, as well as the Buddhist Taisekiji Head Temple founded in 1290, later depicted by Japanese ukiyo-e artist Katsushika Hokusai.","Mount Ashitaka (愛鷹山, Ashitakayama) is an eroded stratovolcano in the area south-east of Mount Fuji, Japan. Its highest peak, 1,504 metres (4,934 ft) high, is Mount Echizen-dake, but the complex is named after its secondary peak, Ashitaka-yama, 1,188 m (3,898 ft) high.","Mount Kenashi (毛無山, Kenashi-yama, lit. \"bald mountain\") is the name for numerous mountains in Japan.\n\nMount Kenashi (Otaru), a 548 m (1,798 ft) mountain in Otaru, Hokkaidō\nMount Kenashi (Yoichi), a 650 m (2,133 ft) mountain on the border of Otaru and Yoichi, Hokkaidō\nMount Kenashi (Setana), a 816 m (2,677 ft) mountain in Setana, Hokkaidō\nMount Kenashi (Hakodate), a 631 m (2,070 ft) mountain in Hakodate, Hokkaidō\nMount Kenashi (Akita), a mountain in Akita Prefecture\nMount Kenashi (Niigata), a mountain in Niigata Prefecture\nMount Kenashi (Nagano), a mountain in Iiyama, Nagano Prefecture\nMount Kenashi (Yamanashi), a 1,500 m (4,921 ft) mountain in Yamanashi Prefecture\nMount Kenashi (Yamanashi, Shizuoka), a 1,946 m (6,385 ft) mountain in Yamanashi and Shizuoka prefectures\nMount Kenashi (Tottori), a 570.5 m (1,872 ft) mountain in Tottori Prefecture\nMount Kenashi (Okayama, Tottori), a mountain in Okayama and Tottori prefectures\nMount Kenashi (Hiroshima), a mountain in Hiroshima Prefecture\nMount Kenashi (Shimane), a 1,062 m (3,484 ft) mountain in Shimane Prefecture","","Mount Hakone (箱根山, Hakoneyama) is a complex volcano in Kanagawa Prefecture, Japan that is truncated by two overlapping calderas, the largest of which is 10 × 11 km wide. The calderas were formed as a result of two major explosive eruptions about 180,000 and 49,000–60,000 years ago. Lake Ashi lies between the southwestern caldera wall and a half dozen post-caldera lava domes that arose along a southwest–northeastern trend cutting through the center of the calderas. Dome growth occurred progressively to the south, and the largest and youngest of them, Kami-yama, forms the high point of Hakone.  The calderas are breached to the east by the Haya-kawa canyon. Mount Ashigara is a parasitic cone.The latest magmatic eruptive activity at Hakone occurred 2,900 years ago. It produced a pyroclastic flow and a lava dome in the explosion crater, although phreatic eruptions took place as recently as the 12–13th centuries AD.According to the nearby Hakone Shrine, the Komagatake peak has been the object of religious veneration since ancient times.","Mount Hakone (箱根山, Hakoneyama) is a complex volcano in Kanagawa Prefecture, Japan that is truncated by two overlapping calderas, the largest of which is 10 × 11 km wide. The calderas were formed as a result of two major explosive eruptions about 180,000 and 49,000–60,000 years ago. Lake Ashi lies between the southwestern caldera wall and a half dozen post-caldera lava domes that arose along a southwest–northeastern trend cutting through the center of the calderas. Dome growth occurred progressively to the south, and the largest and youngest of them, Kami-yama, forms the high point of Hakone.  The calderas are breached to the east by the Haya-kawa canyon. Mount Ashigara is a parasitic cone.The latest magmatic eruptive activity at Hakone occurred 2,900 years ago. It produced a pyroclastic flow and a lava dome in the explosion crater, although phreatic eruptions took place as recently as the 12–13th centuries AD.According to the nearby Hakone Shrine, the Komagatake peak has been the object of religious veneration since ancient times.","","","Mount Amagi (天城山, Amagi-san) is a range of volcanic mountains in central Izu Peninsula in Shizuoka Prefecture, Japan, forming the border between Izu City and Higashi-Izu Town. It is also referred to as the Amagi Mountain Range (天城連山, Amagi Renzan).\n\nThe Amagi mountains have several peaks, the tallest of which are Bansaburōdake (万三郎岳) at 1,406 metres (4,613 ft), Banjirōdake (万二郎岳) at 1,300 metres (4,300 ft), and Tōgasayama (遠笠山) at 1,197 metres (3,927 ft).There are several hiking routes to the top. Flora in the area include rhododendrons, Japanese andromeda, stewartia monadelpha and Siebold's beech.\nMany ships of the Imperial Japanese Navy were named after it, including a corvette, a battlecruiser and an aircraft carrier.\nAmagi is listed as one of the 100 Famous Japanese Mountains in a book composed in 1964 by mountaineer/author Kyūya Fukada.","","","Mount Mihara (三原山, Mihara-yama) is an active volcano on the Japanese isle of Izu Ōshima. Although the volcano is predominantly basaltic, major eruptions have occurred at intervals of 100–150 years.Mount Mihara's major eruption in 1986 saw lava fountains up to 1.6 kilometres (1.0 mi) high. The eruption had a Volcanic Explosivity Index of 3, and involved a central vent eruption, radial fissure eruption, explosive eruption, lava flows, and a lava lake eruption. There was also a 16 km high subplinian plume.  All of the island's 12,000 inhabitants were evacuated by dozens of vessels consisting of both the military and civilian volunteers.The most recent eruption was in 1990.","","","Otake (御岳, O-take) is a stratovolcano in the Tokara Islands of Japan. It is the largest mountain on Nakanoshima, which is part of the village of Toshima in Kagoshima District of Kagoshima Prefecture. Being the largest mountain on a small island, it is also referred to as Nakanoshima. It is also called \"Tokara Fuji\" from its shape.\nThe mountain is an andesitic volcano. The volcano had a minor mud eruption in January 1914. In October 1949 the summit crater produced an ash cloud. The rock of the mountain is non-alkali mafic rock produced in the last 18,000 years.Sulphur mining took place on the southeast flank until 1944. During the rainy season, the summit crater fills with water.The volcano last erupted in 2007.","Otake (御岳, O-take) is a stratovolcano in the Tokara Islands of Japan. It is the largest mountain on Nakanoshima, which is part of the village of Toshima in Kagoshima District of Kagoshima Prefecture. Being the largest mountain on a small island, it is also referred to as Nakanoshima. It is also called \"Tokara Fuji\" from its shape.\nThe mountain is an andesitic volcano. The volcano had a minor mud eruption in January 1914. In October 1949 the summit crater produced an ash cloud. The rock of the mountain is non-alkali mafic rock produced in the last 18,000 years.Sulphur mining took place on the southeast flank until 1944. During the rainy season, the summit crater fills with water.The volcano last erupted in 2007.","","","","","","Mount Suribachi (摺鉢山, Suribachiyama) is a 169-metre (554 ft)-high mountain on the southwest end of Iwo Jima in the northwest Pacific Ocean under the administration of Ogasawara Subprefecture, Tokyo Metropolis, Japan.\nThe mountain's name derives from its shape, resembling a suribachi or grinding bowl. It is also known as \"Mount Pipe\" (パイプ山, paipu-yama), since the volcanic gas and water vapor that rolls in from the summit, alongside the rest of the island, give the appearance of a smoking pipe when viewed from the sea.Joe Rosenthal's iconic World War II photograph, Raising the Flag on Iwo Jima, depicting United States Marines raising an American flag, was taken at the mountain's peak during the Battle of Iwo Jima in 1945. Ammunition ship USS Suribachi was named after this mountain.","","","","Mount Yahiko (弥彦山, Yahiko-yama) is a mountain located in Niigata Prefecture, Japan. \nYahikoyama Ropeway runs between the peak and the foot.","","Mount Kurohime (Japanese: 黒姫山 Kurohime-yama) is a 2,053-metre (6,736 ft) stratovolcano located in Nagano Prefecture, Japan.It is one of the \"Five Mountains of Northern Shinshu\" (北信五岳), which also includes Mount Iizuna (飯縄山), Mount Myōkō (i妙高山), Mount Togakushi (戸隠山) and Mount Madarao (斑尾山).","","","","may refer to","Mount Nokogiri can refer to:\n\nMount Nokogiri (Chiba) (Nokogiriyama), a mountain in Honshū, Japan.\nMount Nokogiri (Hokkaidō) (Nokogiridake), a mountain in Hokkaidō, Japan.\nMount Nokogiri (Akaishi) (Nokogiridake), in the Akaishi Mountains, forming part of the boundary between Nagano and Yamanashi Prefectures","Mount Yake (焼岳, Yake-dake) literally, \"Burning mountain\" is an active volcano in the Hida Mountains, lying between Matsumoto, Nagano Prefecture, and Takayama, Gifu Prefecture, Japan. It is one of the 100 Famous Japanese Mountains, reaching 2,455 m (8,054 ft) at the highest peak.","Mount Amakazari (jp: 雨飾山, Amakazari-yama) is a mountain in the Chūbu region, Central Honshu, Japan. Located between Niigata and Nagano prefectures, the mountain is considered one of the 100 Mountains of Japan. Several hiking paths lead up the mountain, along which can be found a number of natural hot springs.","Mount Hiuchi (火打山, Hiuchi-yama) is one of the 100 Famous Japanese Mountains, reaching the height of 2,462 m (8,077 ft). It is situated in Japan's Kubiki Mountains in Niigata Prefecture. It was specified for Jōshin'etsu Kōgen National Park on July 10, 1956, but since has been absorbed by the Togakushi-Renzan National Park, which encompasses Mount Myōkō (妙高山 Myōkō-san) and Mount Niigata-Yake (新潟焼山 Niigata-Yakeyama).","","Mount Kurohime (Japanese: 黒姫山 Kurohime-yama) is a 2,053-metre (6,736 ft) stratovolcano located in Nagano Prefecture, Japan.It is one of the \"Five Mountains of Northern Shinshu\" (北信五岳), which also includes Mount Iizuna (飯縄山), Mount Myōkō (i妙高山), Mount Togakushi (戸隠山) and Mount Madarao (斑尾山).","","","Mount Iizuna (飯縄山, Iizuna-yama), also known as Mount Izuna (飯綱山, Izuna-yama), is a mountain located ten kilometers north-northwest of the heart of Nagano, Nagano Prefecture, Japan. Together with Mount Reisenji (霊仙寺山, Resenji-yama) 1875.0 m, Mount Menō (瑪瑙山, Menō-yama) 1748 m, and others, it forms the Iizuna range. It has an elevation of 1,917 metres. It is one of the \"Five Mountains of Northern Shinshu\" (北信五岳) that includes: Mount Myōkō (妙高山), Mount Kurohime (黒姫山), Mount Togakushi (戸隠山) and Mount Madarao (斑尾山).\nThis mountain is a sacred site for mountain-based religious sects such as Shugendo, and said to be the home of a tengu named Saburō. According to legend, there was once a strange, edible sand somewhere on the mountain, which the tengu would distribute in times of poor harvest. \n\nThe mountain is also a popular area for skiing and is where the bobsleigh and luge track for the 1998 Winter Olympics is located.","","Mount Hijiri (聖岳, Hijiri-dake) is a mountain located in the Akaishi Mountains in both Aoi-ku, Shizuoka, Shizuoka Prefecture and Iida, Nagano Prefecture, in the Chūbu region of Japan. It is 3,013 m (9,885 ft) tall and part of the Akaishi Mountains. It is the mountain in Minami Alps National Park located in the south most. It is also included on the list of \"100 Famous Japanese Mountains.\" There are several mountain climbing trails and Mountain hut around the mountain. There is the Hijiri-Daira hut in the Mountain pass in the south.","Mount Kamurigi (冠着山, Kamuriki-san) is a  1,252 m (4,108 ft) mountain peak on the border of the city of Chikuma and the village of Chikuhoku in Nagano Prefecture in the Chūbu region of Japan. It is also called Ubasuteyama or Obasuteyama (姨捨山) after an old legend. the mountain is located within the borders of the Yatsugatake-Chūshin Kōgen Quasi-National Park.","","","Mount Kirigamine (霧ヶ峰, Kiri-ga-mine) is a 1,925m volcano, located in Nagano Prefecture, Japan.","Mount Tateshina (蓼科山, Tateshina-yama) also Suwa Fuji is a complex volcano located on the border of the municipalities of Chino and Tateshina in Nagano Prefecture, Japan.\nIt has an elevation of 2,530 m (8,301 ft). This mountain is one of the 100 Famous Japanese Mountains.","may refer to","","Mount Tengu (天狗岳, Tengu-dake) is a 2,646m mountain on the border of Chino and Koumi of Nagano in Japan. This mountain is the highest mountains of Northern Yatsugatake Volcanic Group. Named for the mythical avian creatures of Japanese folklore, the Tengu.","","","may refer to","may refer to","Mount Amida is an 837-metre-high (2,746 ft) mountain in Saeki-ku, Hiroshima, Japan.","","","","","Mount Kurohime (Japanese: 黒姫山 Kurohime-yama) is a 2,053-metre (6,736 ft) stratovolcano located in Nagano Prefecture, Japan.It is one of the \"Five Mountains of Northern Shinshu\" (北信五岳), which also includes Mount Iizuna (飯縄山), Mount Myōkō (i妙高山), Mount Togakushi (戸隠山) and Mount Madarao (斑尾山).","","","Mount Asahi can refer to:\n\nAsahidake, the tallest mountain of Hokkaidō\nMount Asahi (Ishikari), a hill outside Asahikawa, Hokkaidō\nMount Asahi (Yamagata)","","","","Mount Norikura (乗鞍岳, Norikura-dake) is a potentially active volcano located on the borders of Gifu and Nagano prefectures in Japan. It is part of the Hida Mountains and is listed among the 100 Famous Japanese Mountains and the New 100 Famous Japanese Mountains.","","Mt. Shirouma (白馬岳, Shirouma-dake) is a peak in the Hida Mountains range of the Japanese Alps, located in Nagano Prefecture and Toyama Prefecture, central Honshu, Japan.","Mount Asahi can refer to:\n\nAsahidake, the tallest mountain of Hokkaidō\nMount Asahi (Ishikari), a hill outside Asahikawa, Hokkaidō\nMount Asahi (Yamagata)","","","","","","","","","","","","","","","","","Mount Eboshi (烏帽子岳, Eboshi-dake) is a stratovolcano located in the Daisetsuzan Volcanic Group of the Ishikari Mountains, Hokkaidō, Japan.\n\n","","","","","","","Mount Washiba (鷲羽岳, Washiba-dake) is a peak in the Hida Mountains range of the Japanese Alps at 2924m, located in Nagano Prefecture and Toyama Prefecture, central Honshu, Japan. It is listed in 100 Famous Japanese Mountains.","","","","","","may refer to","","","","Mount Dainichi (大日ヶ岳, Dainichi-ga-take) is a mountain located in the cities of Gujō and Takayama in Gifu Prefecture, Japan. It is part of the Ryōhaku Mountains and has a height of 1,709 m (5,607 ft). The rain that falls on the mountain flows into three rivers: the Nagara River, the Shō River and the Kuzuryū River.","","Mount Tate (立山, Tate-yama, IPA: [tate]), commonly referred to as simply Tateyama, is a mountain located in the southeastern area of Toyama Prefecture, Japan. It is one of the tallest mountains in the Hida Mountains at 3,015 m (9,892 ft) and, along with Mount Fuji and Mount Haku, it is one of Japan's \"Three Holy Mountains\" (三霊山, Sanreizan). Tateyama is a term for the mountain consisting of three peaks: Ōnanjiyama (大汝山, 3,015m), Oyama (雄山, 3,003m), and Fuji-no-Oritateyama, (富士ノ折立, 2,999m) which run along a ridge (see photo). Tateyama is the tallest mountain in the Tateyama Mountain Range (立山連峰, Tateyama-renpō).\nIt was first climbed by Saeki no Ariyori during Japan's Asuka period. The area was designated the Chūbu-Sangaku National Park on December 4, 1934.","Mount Ōyama (大山, Ō-yama), also Mount Afuri (阿夫利山 or 雨降り山, Afuri-yama) or Mount Kunimi (Kunimi-yama), is a 1,252-metre-high (4,108 ft) mountain situated on the border of Isehara, Hadano and Atsugi in Kanagawa Prefecture, Japan. Together with Mount Tanzawa and other mountains in the Tanzawa Mountains it forms the Tanzawa-Ōyama Quasi-National Park. Mount Ōyama is a popular sightseeing spot in Kanagawa Prefecture.","","","","","","","Mount Yakushi (薬師岳, Yakushi-dake) is one of the 100 Famous Japanese Mountains, reaching the height of 2,926 m (9,600 ft). It is situated in Japan's Hida Mountains in Toyama Prefecture. It was specified for Chūbu-Sangaku National Park on December 4, 1934.","","","","","Mount Yumiori (弓折岳, Yumiori-dake) is a mountain located in the city of Takayama, Gifu, Japan. It is 2,592 m (8,504 ft) tall and part of the Hida Mountains.","","","","","","","Mount Tsubakuro (燕岳, Tsubakuro-dake) is a 2,763-metre-high (9,065 ft) mountain in Azumino, Nagano Prefecture, Japan. It is situated in Japan's Hida Mountains in Nagano Prefecture.\nIt was specified for Chūbu-Sangaku National Park on December 4, 1934.\nGranite forms the unique body with white sands and sharp rocks exposed at the top. Kassen One (ridge) is a steep trail challenging to climbers ascending from Nakabusa Hot Springs.\n\n","","","","","","","","","","","","","Mount Naka (中岳, Naka-dake) is a mountain with an altitude of 3,084m located in the southern part of the Hida Mountains, which straddles Matsumoto in Nagano Prefecture and Takayama in Gifu Prefecture. This mountain is located in Chūbu-Sangaku National Park.","Mount Minami (南岳, Minami-dake) is a volcano located on the Shiretoko Peninsula in Hokkaido, northeastern Japan.","","","","","","Mount Yake (焼岳, Yake-dake) literally, \"Burning mountain\" is an active volcano in the Hida Mountains, lying between Matsumoto, Nagano Prefecture, and Takayama, Gifu Prefecture, Japan. It is one of the 100 Famous Japanese Mountains, reaching 2,455 m (8,054 ft) at the highest peak.","","","","Mount Norikura (乗鞍岳, Norikura-dake) is a potentially active volcano located on the borders of Gifu and Nagano prefectures in Japan. It is part of the Hida Mountains and is listed among the 100 Famous Japanese Mountains and the New 100 Famous Japanese Mountains.","","Mount Hachimori (鉢盛山, Hachimori-yama) is a mountain of the Yūbari Mountains on the border of Minamifurano, Yūbari, Hokkaidō, Japan. It is the source of the Yūbari River.","Mount Ontake (御嶽山, Ontake-san), also referred to as Mount Kiso Ontake (木曽御嶽山, Kiso Ontake-san), is the 14th highest mountain and second highest volcano in Japan (after Mount Fuji) at 3,067 m (10,062 ft). It is included in 100 Famous Japanese Mountains.","","","","","","","","","may refer to","may refer to","may refer to","Mount Sannosawa (三ノ沢岳, Sannosawa-dake) is amongst the Kiso Mountains,  located in the Kiso District, Nagano Prefecture, in the Chūbu region of Japan. It is 2,846 m (9,337 ft) tall. It is composed of Granite, and has a 120 m (394 ft) long 30 m (98 ft) wide cirque covered in dense vegetation, mainly pine trees. There is the \"Sannosawa cirque\". Glacial expansion has created a gully, just underneath the cirque. A lot of Alpine plant grow naturally. Name River and Ina River (Tributary of Kiso River) that become the sources flow to the Ise Bay of Pacific Ocean. There is the tributary called \"Sannosawa\" around Mount Sannosawa. Komagatake Ropeway is used to climb.","","","","Mount Utsugi (空木岳, Utsugi-dake) is a mountain located on the boundary of Okuwa, Iijima and Miyada, Nagano Prefecture, in the Chūbu region of Japan. It is 2,864 m (9,396 ft) tall and part of the Kiso Mountains. It is also included on the list of \"100 Famous Japanese Mountains.\"","","","","","","","","","Mount Ena (恵那山, Ena-san) is a mountain peak of the Kiso Mountains range in the Chūbu region of Japan.","Mount Moriya (Bulgarian: връх Мория, romanized: vrah Moriya, IPA: [ˈvrɤx moˈrijɐ]) is the rounded, ice-covered peak rising to 1700 m in Lovech Heights on Nordenskjöld Coast in Graham Land, Antarctica.  It is surmounting Rogosh Glacier to the south and northwest, Zlokuchene Glacier to the east-northeast, and Risimina Glacier to the southeast.\nThe feature is named after the medieval fortress of Moriya in western Bulgaria.","","Mount Nokogiri can refer to:\n\nMount Nokogiri (Chiba) (Nokogiriyama), a mountain in Honshū, Japan.\nMount Nokogiri (Hokkaidō) (Nokogiridake), a mountain in Hokkaidō, Japan.\nMount Nokogiri (Akaishi) (Nokogiridake), in the Akaishi Mountains, forming part of the boundary between Nagano and Yamanashi Prefectures","may refer to","","Mount Futago (69°12′S 39°44′E) is a small mountain with two peaks, the northern one being 240 metres (790 ft) and the southern one 245 metres (800 ft) high, in the northern part of the Langhovde Hills, Queen Maud Land, Antarctica. It was mapped from surveys and air photos by the Japanese Antarctic Research Expedition (JARE), 1957–62. The name Futago-yama (Hutago Yama), meaning \"twin mountain,\" was given by JARE Headquarters in 1972.","","","","","","","","","","","","Mount Kita (北岳, Kita-dake) is a mountain of the Akaishi Mountains−\"Southern Alps\" (南アルプス Minami-Arupusu), in Yamanashi Prefecture, Japan.\nIt is the second tallest mountain in Japan, after Mount Fuji, and is known as \"the Leader of the Southern Alps\". It is included in the 100 Famous Japanese Mountains. It is located in Minami Alps National Park, near the city of Minami-Alps.","Mount Aino (間ノ岳, Aino-dake), or Ainodake, is a peak of the Akaishi Mountains−Southern Alps, in Minami Alps National Park, Japan. At 3,189 m (10,463 ft), it is the fourth tallest peak in Japan and the second highest in the Akaishi Mountains.Its summit lies on the border of Aoi-ku and Shizuoka in Shizuoka Prefecture, and of Minami-Alps in Yamanashi Prefecture. Mount Aino is one of the landmark 100 Famous Japanese Mountains.","","","","","","","","","","","Mt. Shiomi (塩見岳, Shiomi-dake) is a mountain located in the centre of the Akaishi Mountains−Southern Alps, within Minami Alps National Park, Japan. It is on the border of Shizuoka and Nagano Prefectures.  It is one of the 100 Famous Japanese Mountains.  \nAt 3,047 m tall, it is the 16th tallest mountains and hills of Japan. There is the mountaineering route on from a ridge in Akaishi Mountains.","","","","","Mount Eboshi (烏帽子岳, Eboshi-dake) is a stratovolcano located in the Daisetsuzan Volcanic Group of the Ishikari Mountains, Hokkaidō, Japan.\n\n","","","","","Mount Higashi (東岳, Higashi-dake) is a volcano located on the Shiretoko Peninsula in Hokkaido, Japan.","Mount Warusawa (悪沢岳, Warusawa-dake), also Mount Higashi (東岳, Higashi-dake), is a mountain located in Shizuoka Prefecture, Japan. It has a height of 3,141 metres (10,305 ft). It is located in the southern part of the Akaishi Mountains, which are known as the \"Southern Alps\" (南アルプス Minami-Alps). It is located in the Minami Alps National Park\n.","Mount Warusawa (悪沢岳, Warusawa-dake), also Mount Higashi (東岳, Higashi-dake), is a mountain located in Shizuoka Prefecture, Japan. It has a height of 3,141 metres (10,305 ft). It is located in the southern part of the Akaishi Mountains, which are known as the \"Southern Alps\" (南アルプス Minami-Alps). It is located in the Minami Alps National Park\n.","Mount Akaishi (赤石岳, Akaishi-dake), is a peak in the Akaishi Mountains, on the border of Shizuoka and Nagano Prefectures in central Honshū, Japan.\nOn June 1, 1964, the mountain was included within the Minami Alps National Park.","","","","","","Mount Hijiri (聖岳, Hijiri-dake) is a mountain located in the Akaishi Mountains in both Aoi-ku, Shizuoka, Shizuoka Prefecture and Iida, Nagano Prefecture, in the Chūbu region of Japan. It is 3,013 m (9,885 ft) tall and part of the Akaishi Mountains. It is the mountain in Minami Alps National Park located in the south most. It is also included on the list of \"100 Famous Japanese Mountains.\" There are several mountain climbing trails and Mountain hut around the mountain. There is the Hijiri-Daira hut in the Mountain pass in the south.","","","","Mount Tekari (光岳, Tekari-dake) is part of the Akaishi Mountains on the border of Shizuoka and Nagano prefectures in Japan. It is the southernmost mountain in the Akaishi Mountains and the southernmost mountain over 2,500 metres (8,202 ft) in Japan.","","","","","","","","","","Mount Akiha (秋葉山, Akiha-san) is a mountain in Tenryū-ku, Hamamatsu (in the former town of Haruno), Shizuoka Prefecture, Japan. It is a peak on a southern spur of the Akaishi Mountains.\nMount Akiha has an elevation of 866 metres (2,841 ft). It is the location of the Akihasan Hongū Akiha Jinja shrine, dedicated to a god of fire. Belief in the Akiha kami as protectors against fire became widespread in the Edo period of Japanese history, leading to the popularity of pilgrimages to climb this mountain.","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","Mt. Kurai (位山, Kurai-yama) is located on the border of the cities of Takayama and Gero in Gifu Prefecture, Japan. The mountain also separates the watersheds of the northern and southern portions of the Hida region. The Jinzū River flows to the north and the Hida River flows to the south.","","","","","","","","","","","","","","Mount Haku (白山, Haku-san, \"White Mountain\"), or Mount Hakusan (commonly referred to as simply Hakusan), is a dormant stratovolcano in Japan. It is located on the borders of Gifu and Ishikawa, on the island of Honshu. Mount Haku is thought to have first been active 300,000 to 400,000 years ago, with the most recent eruption occurring in 1659. Along with Mount Tate and Mount Fuji, it is one of Japan's \"Three Holy Mountains\" (三霊山, San-rei-zan).","","","","","","","","","","","","Mount Ōyama (大山, Ō-yama), also Mount Afuri (阿夫利山 or 雨降り山, Afuri-yama) or Mount Kunimi (Kunimi-yama), is a 1,252-metre-high (4,108 ft) mountain situated on the border of Isehara, Hadano and Atsugi in Kanagawa Prefecture, Japan. Together with Mount Tanzawa and other mountains in the Tanzawa Mountains it forms the Tanzawa-Ōyama Quasi-National Park. Mount Ōyama is a popular sightseeing spot in Kanagawa Prefecture.","","","","","","","","","Mount Kanmuri (冠山, Kanmuri-yama, Kammuri-yama) is the name of several mountains in Japan.\n\nMount Kanmuri (Gifu, Fukui), located on the borders of Gifu and Fukui prefectures with a height of 1,256.6 m (4,123 ft)\nMount Kanmuri (Matsuyama), located in Matsuyama, Ehime Prefecture\nMount Kanmuri (Ehime, Kōchi), located on the borders of Ehime and Kōchi prefectures with a height of 1,732 m (5,682 ft)\nMount Kanmuri (Ōita), located in Ōita Prefecture with a height of 761 m (2,497 ft)\nMount Kanmuri (Hatsukaichi, Hiroshima), located in Hatsukaichi, Hiroshima Prefecture with a height of 1,339 m (4,393 ft)","","","Mount Ibuki (伊吹山, Ibuki-yama) is a 1,377-metre-high (4,518 ft) mountain, on the border of Maibara, Shiga Prefecture, and Ibigawa, Gifu Prefecture, Japan. It is one of the 100 Famous Japanese Mountains, and is also included on the lists of the 100 Kinki Mountains and the 50 Shiga Mountains. Mount Ibuki is the highest mountain in Shiga Prefecture.","","","","Mount Oike (御池岳, Oikegatake) is a mountain with an altitude of 1,247 m in the Suzuka Mountains in Higashiōmi, Shiga Prefecture. The northeastern side of the hillside is located on the border with Inabe, Mie Prefecture. It is the highest peak in the Suzuka Mountains and Higashiōmi.","","Mount Gozaisho (御在所岳, Gozaisho-dake) is a Japanese mountain located on the border of Komono, Mie Prefecture and Higashi-Ōmi, Shiga Prefecture.\nThis mountain is the center of Suzuka Quasi-National Park.\n\n","","","","","","","","","Mount Hiei (比叡山, Hiei-zan) is a mountain to the northeast of Kyoto, lying on the border between the Kyoto and Shiga Prefectures, Japan.\nThe temple of Enryaku-ji, the first outpost of the Japanese Tendai (Chin. Tiantai) sect of Buddhism, was founded atop Mount Hiei by Saichō in 788 and rapidly grew into a sprawling complex of temples and buildings that were roughly divided into three areas:\n\nThe Saitō (西塔, \"West Pagoda\") area near the summit, and technically in Kyoto Prefecture.\nThe Tōdō (東塔, \"East Pagoda\") area, also near the summit, where Enryaku-ji Temple was first founded, and located just within Shiga Prefecture.\nThe Yokawa (横川, \"Along the river\") area near the northernmost end of Mount Hiei.  Due to its remoteness, as a temple complex it experienced periods of revival and decline, starting with Ennin, later revived by Ryōgen and made famous by the scholar-monk Genshin.Due to its position north-east of the ancient capitol of Kyoto, it was thought in ancient geomancy practices to be a protective bulwark against negative influences on the capitol, which along with the rise of the Tendai sect in Heian period Japan (8th - 12th centuries) meant that the mountain and the temple complex were politically powerful and influential.  Later schools of Buddhism in Japan were almost entirely founded by ex-monks of the Tendai sect, such as Hōnen, Nichiren, Dōgen and Shinran, who  all studied at the temple before leaving Mount Hiei to start their own practices. \nThe temple complex was razed by Oda Nobunaga in 1571 to quell the rising power of Tendai's warrior monks (sōhei), but it was rebuilt and remains the Tendai headquarters to this day.\nThe 19th-century Japanese ironclad Hiei was named after this mountain, as was the more famous World War II-era battleship Hiei, the latter having initially been built as a battlecruiser.","","Mount Mikami (Japanese: 三上山, pronounced \"Mikami Yama\", meaning Mikami Mountain) is a mountain, 432 metres (1,417 ft) above sea level, located in Yasu City, Shiga Prefecture, Japan. In spite of its relatively low altitude, it is also called \"Ōmi Fuji\", that is Mount Fuji of Ōmi Province, the old name of Shiga Prefecture, because of its conical shape standing out in the flat area on the shores of Lake Biwa.\nIt is now part of Mikami-Tanakami-Shigaraki Prefectural Natural Park, established in 1969. Both Mount Ibuki, Shiga Prefecture's highest peak, and Mount Mikami can be spotted easily from the windows of the Tokyo-Kyoto/Osaka Shinkansen train, as it passes through the prefecture.\nMount Mikami, nearer to Kyoto, the traditional capital of Japan, has appeared in the Japanese literature from the ancient times. It is particularly noted for the legend of \"Fujiwara no Hidesato Conquering the Giant Centipede of Mount Mikami\".\nAt the foot of Mount Mikami is the Shintoist Mikami Shrine (Japanese: 御神神社, pronounced \"Mikami Jinja\", meaning the Gods' Shrine), a Kanpei-chūsha.","","","Mount Wakakusa (若草山, Wakakusa-yama), also known as Mount Mikasa (三笠山 Mikasa-yama), is a 342-metre-high (1,122 ft) hill located in Nara, Nara Prefecture, Japan, to the east of Nara Park. The mountain's name literally translates to \"young grass\".\nOn the fourth Saturday of each January, the dead grass of Mount Wakakusa is burned in an annual festival known as Yamayaki (山焼き literally \"mountain burning\").  The tradition supposedly originated from a boundary dispute between two temples, Tōdai-ji and Kōfuku-ji in 1760. As the mediations failed, the entire mountain was set ablaze. Other explanations suggest the extermination of wild boars or pests as a result. The festival today begins with a ceremonial igniting by members of both temples, followed by a fireworks display. The festival has been postponed due to poor weather in the past.","Mount Miwa (三輪山, Miwa-yama) or Mount Mimoro (三諸山, Mimoro-yama) is a mountain located in the city of Sakurai, Nara Prefecture, Japan.  It has been an important religious and historical mountain in Japan, especially during its early history, and serves as a holy site in Shinto.  The entire mountain is considered sacred, and is home to one of the earliest Shinto shrines, Ōmiwa Shrine.  Several burial mounds from the Kofun period can be found around the mountain.\nThe kami (spirit) generally associated with Mount Miwa is Ōmononushi (大物主) (Ōmono-nushi-no-kami), a rain kami.  However, the Nihon Shoki notes that there was a degree of uncertainly when it came to naming the principal kami of Mount Miwa, but he is often linked to Ōkuninushi.","Mount Miminashi (耳成山, Miminashi-yama) is a mountain located in the Nara Basin, in the city of Kashihara, in the central-western part Nara Prefecture, Japan. Together with Mount Unebi and Mount Amanokagu, it belongs to the so-called \"Yamato Sanzan\".","Mount Amanokagu (天香久山, Amanokagu-yama) is a mountain in the city of Kashihara, in the central-western part Nara Prefecture, Japan. Together with Mount Unebi and Mount Miminashi, it belongs to the so-called \"Yamato Sanzan\". It is at the end of Ryumon Mountains that continues from Mount Tatake in comparison to the other two mountains being a sole peak.","Mount Unebi (畝傍山, Unebi-yama) is a mountain in the city of Kashihara, in the central-western part Nara Prefecture, Japan. Together with Mount Amanokagu and Mount Miminashi, it belongs to the so-called \"Yamato Sanzan\", in which it is the highest. At the foot of the mountain are gneiss new rocks, and part of the middle slope and higher are biotite and andesite. At the top is a funnel of an extinct crater.","Mount Ikoma (生駒山, Ikoma-yama) is a mountain on the border of Nara Prefecture and Osaka Prefecture in Japan. It is the highest peak in the Ikoma Mountains with a height of 642 meters.\nMount Ikoma is a part of Kongō-Ikoma-Kisen Quasi-National Park. It is one of the most famous picnic spots in the Kansai region. On the top of the mountain, there are many TV towers for broadcasting to the Kansai region and Ikoma Sanjo Amusement Park.","Mount Shigi (信貴山, Shigisan) is a mountain located in Ikoma District, Nara, Japan.","","Mount Katsuragi (葛城山, Katsuragi-san) is a name used for multiple mountains in Japan. It can refer to:\n\nMount Izumi Katsuragi, on the border of Osaka and Wakayama Prefectures\nMount Minami Katsuragi, east of Mt. Izumi Katsuragi, south of Mount Iwawaki\nMount Naka Katsuragi, south of Mt. Kongō\nMount Yamato Katsuragi, straddling the prefectural line between Nara and Osaka Prefectures\nMount Katsuragi (Izunokuni) on the Izu Peninsula, ShizuokaWhen read \"Katsuragi-yama,\" it collectively refers to Mount Kongō and Mount Yamato Katsuragi","","","Mount Katsuragi (葛城山, Katsuragi-san) is a name used for multiple mountains in Japan. It can refer to:\n\nMount Izumi Katsuragi, on the border of Osaka and Wakayama Prefectures\nMount Minami Katsuragi, east of Mt. Izumi Katsuragi, south of Mount Iwawaki\nMount Naka Katsuragi, south of Mt. Kongō\nMount Yamato Katsuragi, straddling the prefectural line between Nara and Osaka Prefectures\nMount Katsuragi (Izunokuni) on the Izu Peninsula, ShizuokaWhen read \"Katsuragi-yama,\" it collectively refers to Mount Kongō and Mount Yamato Katsuragi","","","","","","","Mount Takami (高見山, Takami-san/Takami-yama) is a 1,248.3 m (4,095 ft) mountain of Daiko Mountains, which is located on the border of Higashiyoshino, Nara, and Matsusaka, Mie, Japan","","","","","Mount Ōyama (大山, Ō-yama), also Mount Afuri (阿夫利山 or 雨降り山, Afuri-yama) or Mount Kunimi (Kunimi-yama), is a 1,252-metre-high (4,108 ft) mountain situated on the border of Isehara, Hadano and Atsugi in Kanagawa Prefecture, Japan. Together with Mount Tanzawa and other mountains in the Tanzawa Mountains it forms the Tanzawa-Ōyama Quasi-National Park. Mount Ōyama is a popular sightseeing spot in Kanagawa Prefecture.","","","","","","Mount Misen (弥山, Misen) is the sacred mountain on Itsukushima in Hatsukaichi, Hiroshima, Japan, and is the highest mountain on the island at 535 m; it is situated within the World Heritage area of Itsukushima Shrine.The sea around the island (Seto Inland Sea) and all of the island are within Setonaikai National Park.The north side of the mountain is covered by primeval forest which is protected by Hiroshima prefecture. The foot of the mountain has Momijidani-Kōen (紅葉谷公園, Maple Valley Park).According to the website of Miyajima Tourist Association, Mount Misen was visited by Kūkai in the year 806, the 1st year of the Daidō era. Since ancient times, the mountain has been an important destination for religious visitors.","","","","","","","","","","","","","","","","","","","","","","","","","","","","","Mount Atago is a very common name for peaks all over Japan.\nMount Atago (愛宕山, Atago-yama/san) is a 924m mountain in the northwestern part of Ukyo-ku, in the city of Kyoto, Kyoto Prefecture, Japan.  The Atago Shrine is located on the top of the mountain.","","","","","Mount Mitake (御岳山, Mitake-san) is a mountain in the Chichibu Tama Kai National Park near Tokyo, Japan. It stands 929 m (3,048 ft) tall. On the mountain is a Shinto shrine where practices such as Futomani divination take place.\nIt is one of the many highlights of the Chichibu Tama Kai National Park, which covers more than 1,250 km2 (483 sq mi) of forested mountains, hills, gorges and some rural towns in the prefectures of Yamanashi, Saitama, Nagano and Tokyo.\nThe trip from Tokyo's Shinjuku Station to Mitake Station on the Ōme Line takes about 95 minutes. \nA shuttle bus, located 50 meters to the left of Mitake Station, travels to Takimoto village every half-hour between 07:30 to 18:00. From Takimoto village, the Mitake-Tozan Railway cable car operates every half-hour between 07:30 to 18:30 and leads to Mitakesan village at its top. Mitake summit and the Musashi-Mitake Shrine (武蔵御嶽神社 (Musashi Mitake Jinja)) can then be reached by trail—approximately 1000 meters.\nMany hikers access the mountain via Kori Station (two stops past Mitake Station from Ome).  There is a hiking trail that takes approximately two and half hours to reach the summit, which passes Otsukayama (920 metres).\nThere is also a festival every year on May 8.","","","","Ōeyama (Japanese: 大枝山), also known as Ooe-yama and Mount Ooe, is a mountain in Kyoto Prefecture, Japan. The mount is 480m high. The mountain is located in the boundary between Nishikyo Ward, Kyoto, and Kameoka. It is also called 大江山 (Ōeyama) (in Man'yōshū) or (大井山) Ōiyama (大井山) (in Nihon Kōki). Oinosaka-toge Pass (老ノ坂峠) is located on the north-side slope of this mountain. In the past, the slope where pass of Mt. Oe was called 'Oeno-saka Slope' (大江坂), but is now referred to as Oino-saka Slope (老の坂). It is the most famous for the legend of Shuten-dōji, an oni. It is now the site of a ski resort, about 20 minutes by bus from Miyazu Station on the KTR Miyazu Line.","","","","Mount Maya (摩耶山, Maya-san) is a 698.6-metre-high (2,292 ft) mountain in Kobe, Hyōgo Prefecture, Japan. This mountain is one of the major peaks of the Rokkō Mountains, and is the most popular peak for visitors on the West-Rokkō Mountains.","","","","","Mount Kasagata (笠形山, Kasagata-yama) is a 939.4 m (3,082 ft) mountain in the Chūgoku Mountains, located on the border of Taka and Kamikawa, Hyōgo, Japan. This mountain is one of Hyōgo 50 mountains. This mountain is an important center of Kasagatayama-Sengamine Prefectural Natural Park.","","","","","","Mount Seppiko (雪彦山, Seppiko-san) is a mountain or mountains in Himeji, Hyōgo, Japan. This mountain is one of the San-hiko-san, three Hiko Shugendō mountains in Japan, and also one of Hyōgo 50 mountains, and Kinki 100 mountains. It forms part of Seppiko-Mineyama Prefectural Natural Park.","","","","Mount Mimuro (三室山, Mimuro-yama) is a mountain on the border of Shisō, Hyōgo Prefecture, and Wakasa, Tottori Prefecture, Japan. The height is 1,358.0 m (4,455 ft), and this mountains is the second highest mountain in Hyōgo Prefecture after Mount Hyōno.","","","Mount Ushiro (後山, Ushiro-yama) is a mountain on the border of Shisō, Hyōgo Prefecture, and Mimasaka, Okayama Prefecture, Japan. It is the highest mountain in Okayama Prefecture and the third highest mountain in Hyōgo Prefecture, after Mount Hyōno and Mount Mimuro. In Hyōgo Prefecture this mountain is also known as Itabami-san and in Tottori Prefecture it is also known as Ushiro-no-sen.","Mount Nagi (那岐山, Nagi-san), is a mountain located on the border of Chizu, Tottori Prefecture, and Nagi, Okayama Prefecture, Japan. The other reading of this mountain's kanji is Nagisen.\nThis mountain is an important part of Hyōnosen-Ushiroyama-Nagisan Quasi-National Park, with Mount Hyōno and Mount Ushiro.","","","","","","","","Mount Asahi can refer to:\n\nAsahidake, the tallest mountain of Hokkaidō\nMount Asahi (Ishikari), a hill outside Asahikawa, Hokkaidō\nMount Asahi (Yamagata)","","","","","","","Mount Daisen (大山, Daisen), is a volcanic mountain in Tottori Prefecture, Japan. It has an elevation of 1,729 metres. This mountain is the highest in the Chūgoku region, and the most important volcano on the Daisen volcanic belt: a part of Southwest Honshu volcanic arc, where the Philippine Sea Plate is subducting under the Amurian Plate.","","","","","","","","","may refer to","may refer to","","","","","","","","","","","","Mount Noro (野呂山, Noro-san) is one of the most popular mountains around Hiroshima, Japan. It is part of the Setonaikai National Park.\nMount Misen is famous for mountain climbing, trekking, camping and sakura, camellia, hydrangea, autumn leaves and maples and sunset view.\nThere are historical shrines and temples include Noro Shrine (野呂神社, Noro-jinja) and Kōbō Temple (弘法寺, Kōbō-ji).","","","","","","","","","","","Mount Kanmuri (冠山, Kanmuri-yama, Kammuri-yama) is the name of several mountains in Japan.\n\nMount Kanmuri (Gifu, Fukui), located on the borders of Gifu and Fukui prefectures with a height of 1,256.6 m (4,123 ft)\nMount Kanmuri (Matsuyama), located in Matsuyama, Ehime Prefecture\nMount Kanmuri (Ehime, Kōchi), located on the borders of Ehime and Kōchi prefectures with a height of 1,732 m (5,682 ft)\nMount Kanmuri (Ōita), located in Ōita Prefecture with a height of 761 m (2,497 ft)\nMount Kanmuri (Hatsukaichi, Hiroshima), located in Hatsukaichi, Hiroshima Prefecture with a height of 1,339 m (4,393 ft)","Mount Jakuchi (寂地山, Jakuchi-san) is a mountain located on the border of Iwakuni, Yamaguchi Prefecture, and Yoshika, Shimane Prefecture, Japan. \nIt is the highest mountain in Yamaguchi Prefecture.","","","","","","","","","","","","","Mount Katsuragi (葛城山, Katsuragi-san) is a name used for multiple mountains in Japan. It can refer to:\n\nMount Izumi Katsuragi, on the border of Osaka and Wakayama Prefectures\nMount Minami Katsuragi, east of Mt. Izumi Katsuragi, south of Mount Iwawaki\nMount Naka Katsuragi, south of Mt. Kongō\nMount Yamato Katsuragi, straddling the prefectural line between Nara and Osaka Prefectures\nMount Katsuragi (Izunokuni) on the Izu Peninsula, ShizuokaWhen read \"Katsuragi-yama,\" it collectively refers to Mount Kongō and Mount Yamato Katsuragi","","","","","","","","Mount Misen (弥山, Misen) is the sacred mountain on Itsukushima in Hatsukaichi, Hiroshima, Japan, and is the highest mountain on the island at 535 m; it is situated within the World Heritage area of Itsukushima Shrine.The sea around the island (Seto Inland Sea) and all of the island are within Setonaikai National Park.The north side of the mountain is covered by primeval forest which is protected by Hiroshima prefecture. The foot of the mountain has Momijidani-Kōen (紅葉谷公園, Maple Valley Park).According to the website of Miyajima Tourist Association, Mount Misen was visited by Kūkai in the year 806, the 1st year of the Daidō era. Since ancient times, the mountain has been an important destination for religious visitors.","","","","","","","","","","","","","Mount Bizan (眉山, Bizan) is a mountain in the city of Tokushima in Tokushima Prefecture. The mountain's name is written with the characters for eyebrow and mountain. Bizan is said to have earned this name because the mountain resembles the countures of an eyebrow from all directions. Regarded as a symbol of Tokushima City, the name Mount Bizan appears in many school songs in the city district, such as the Tokushima Prefectural Jonan High School, Tokushima Municipal High School and many more.","","","","","","may refer to","may refer to","","","","","","","","","","","","","","","Mount Inamura (稲叢山, Inamura-yama) is the highest mountain in Kōchi Prefecture, Japan, at 1,506 m (4,941 ft). Situated in the town of Tosa, Mount Inamura is famous for its Akebono-tsutsuji (Rhododendron pentaphyllum) flowers, which bloom during the middle of spring season (April–May).\n\n","","","","","","","Mount Ishizuchi (石鎚山, Ishizuchi-san) is a 1,982-metre-high (6,503 ft) mountain on the border of Saijō and Kumakōgen, in Ehime, Japan. This mountain is one of the 100 famous mountains in Japan.  It is the highest mountain in Western Japan and the island of Shikoku.","","","","","","","","","","","The Irazú Volcano (Spanish: Volcán Irazú) is an active volcano in Costa Rica, situated in the Cordillera Central close to the city of Cartago.\nThe name could come from either the combination of \"ara\" (point) and \"tzu\" (thunder) or a corruption of Iztarú, which was the name of an indigenous village on the flanks of the volcano.  In Costa Rica it is known by the name of \"El Coloso\" (The Colossus) due to the catastrophes that it has provoked in the past.\n\nThe volcano's summit has several craters, one of which contains Diego de la Haya, a green crater lake of variable depth. At 11,260 feet (3,432 m), the Irazú Volcano is the highest active volcano in Costa Rica.   It is easily visited from San José, with a road leading right up to the summit craters and a weekly bus service to the top.  It is thus a popular tourist spot. The summit of the volcano also houses a few television transmitters for television stations in San José.\nFrom the top it is possible to see both the Atlantic and Pacific Oceans  on a clear day. However, such clear days are rare, and the volcano's summit is usually cloud-covered.\nThe volcano is contained within the Irazú Volcano National Park, which spreads across 5,705 acres (2,300 ha). The national park contains both primary and secondary montane forests and is home to armadillos, owls, rabbits, foxes, woodpeckers, and hummingbirds.","","","","","","","","","","","","","Mount Hiko (英彦山, Hiko-san), is a mountain on the border between Fukuoka Prefecture and Ōita Prefecture in Kyūshū, Japan. It has an elevation of 1,200 metres. \nIt is an important site for Shugendo, and a famous place for rock climbing. It is supposed Miyamoto Musashi stayed there in order to train after surviving the Toyotomi clan defeat at Sekigahara.","","","","","Mount Sefuri (脊振山, Sefuri-san) is a 1,054.6 m (3,460 ft) peak of the Sefuri Mountains, which are located on the border of Fukuoka, Fukuoka Prefecture, and Kanzaki, Saga Prefecture, Japan.","","","Mount Futago (69°12′S 39°44′E) is a small mountain with two peaks, the northern one being 240 metres (790 ft) and the southern one 245 metres (800 ft) high, in the northern part of the Langhovde Hills, Queen Maud Land, Antarctica. It was mapped from surveys and air photos by the Japanese Antarctic Research Expedition (JARE), 1957–62. The name Futago-yama (Hutago Yama), meaning \"twin mountain,\" was given by JARE Headquarters in 1972.","","Mount Tsurumi (鶴見岳, Tsurumi-dake) is a 1,374.5 m (4,510 ft) volcano in Beppu, Ōita, Japan.","Mount Yufu (由布岳, Yufudake) is a 1,583.3 m (5,195 ft) volcano, located on the border of Yufu and Beppu, Ōita, Japan.","","","","","","","","","Mount Aso (阿蘇山, Aso-san) is the largest active volcano in Japan, and is among the largest in the world. It stands in Aso Kujū National Park in Kumamoto Prefecture, on the island of Kyushu. Its peak is 1,592 meters (5,223 ft) above sea level.  Mount Aso has a fairly large caldera (25 kilometers (16 miles) north-south and 18 km (11 mi) east-west) with a circumference of around 120 km (75 mi), although sources vary on the exact distance.","Mount Aso (阿蘇山, Aso-san) is the largest active volcano in Japan, and is among the largest in the world. It stands in Aso Kujū National Park in Kumamoto Prefecture, on the island of Kyushu. Its peak is 1,592 meters (5,223 ft) above sea level.  Mount Aso has a fairly large caldera (25 kilometers (16 miles) north-south and 18 km (11 mi) east-west) with a circumference of around 120 km (75 mi), although sources vary on the exact distance.","Mount Aso (阿蘇山, Aso-san) is the largest active volcano in Japan, and is among the largest in the world. It stands in Aso Kujū National Park in Kumamoto Prefecture, on the island of Kyushu. Its peak is 1,592 meters (5,223 ft) above sea level.  Mount Aso has a fairly large caldera (25 kilometers (16 miles) north-south and 18 km (11 mi) east-west) with a circumference of around 120 km (75 mi), although sources vary on the exact distance.","Mount Aso (阿蘇山, Aso-san) is the largest active volcano in Japan, and is among the largest in the world. It stands in Aso Kujū National Park in Kumamoto Prefecture, on the island of Kyushu. Its peak is 1,592 meters (5,223 ft) above sea level.  Mount Aso has a fairly large caldera (25 kilometers (16 miles) north-south and 18 km (11 mi) east-west) with a circumference of around 120 km (75 mi), although sources vary on the exact distance.","Mount Aso (阿蘇山, Aso-san) is the largest active volcano in Japan, and is among the largest in the world. It stands in Aso Kujū National Park in Kumamoto Prefecture, on the island of Kyushu. Its peak is 1,592 meters (5,223 ft) above sea level.  Mount Aso has a fairly large caldera (25 kilometers (16 miles) north-south and 18 km (11 mi) east-west) with a circumference of around 120 km (75 mi), although sources vary on the exact distance.","","","","Mount Ōyama (大山, Ō-yama), also Mount Afuri (阿夫利山 or 雨降り山, Afuri-yama) or Mount Kunimi (Kunimi-yama), is a 1,252-metre-high (4,108 ft) mountain situated on the border of Isehara, Hadano and Atsugi in Kanagawa Prefecture, Japan. Together with Mount Tanzawa and other mountains in the Tanzawa Mountains it forms the Tanzawa-Ōyama Quasi-National Park. Mount Ōyama is a popular sightseeing spot in Kanagawa Prefecture.","","","","Mount Ōyama (大山, Ō-yama), also Mount Afuri (阿夫利山 or 雨降り山, Afuri-yama) or Mount Kunimi (Kunimi-yama), is a 1,252-metre-high (4,108 ft) mountain situated on the border of Isehara, Hadano and Atsugi in Kanagawa Prefecture, Japan. Together with Mount Tanzawa and other mountains in the Tanzawa Mountains it forms the Tanzawa-Ōyama Quasi-National Park. Mount Ōyama is a popular sightseeing spot in Kanagawa Prefecture.","","","","","Mount Unzen (雲仙岳, Unzen-dake) is an active volcanic group of several overlapping stratovolcanoes, near the city of Shimabara, Nagasaki on the island of Kyushu, Japan's southernmost main island.\nIn 1792, the collapse of one of its several lava domes triggered a megatsunami that killed 14,524 people in Japan's worst volcanic-related disaster. The volcano was most recently active from 1990 to 1995, and a large eruption in 1991 generated a pyroclastic flow that killed 43 people, including three volcanologists.\nIts highest peaks are Fugen-dake (普賢岳) at 1,359 metres (4,459 ft) and Heisei-shinzan (平成新山) at 1,486 metres (4,875 ft). The latter emerged during the eruptions of the early, eponymous Heisei era (1989–2019).","Mount Unzen (雲仙岳, Unzen-dake) is an active volcanic group of several overlapping stratovolcanoes, near the city of Shimabara, Nagasaki on the island of Kyushu, Japan's southernmost main island.\nIn 1792, the collapse of one of its several lava domes triggered a megatsunami that killed 14,524 people in Japan's worst volcanic-related disaster. The volcano was most recently active from 1990 to 1995, and a large eruption in 1991 generated a pyroclastic flow that killed 43 people, including three volcanologists.\nIts highest peaks are Fugen-dake (普賢岳) at 1,359 metres (4,459 ft) and Heisei-shinzan (平成新山) at 1,486 metres (4,875 ft). The latter emerged during the eruptions of the early, eponymous Heisei era (1989–2019).","","","Mount Mitake (御岳山, Mitake-san) is a mountain in the Chichibu Tama Kai National Park near Tokyo, Japan. It stands 929 m (3,048 ft) tall. On the mountain is a Shinto shrine where practices such as Futomani divination take place.\nIt is one of the many highlights of the Chichibu Tama Kai National Park, which covers more than 1,250 km2 (483 sq mi) of forested mountains, hills, gorges and some rural towns in the prefectures of Yamanashi, Saitama, Nagano and Tokyo.\nThe trip from Tokyo's Shinjuku Station to Mitake Station on the Ōme Line takes about 95 minutes. \nA shuttle bus, located 50 meters to the left of Mitake Station, travels to Takimoto village every half-hour between 07:30 to 18:00. From Takimoto village, the Mitake-Tozan Railway cable car operates every half-hour between 07:30 to 18:30 and leads to Mitakesan village at its top. Mitake summit and the Musashi-Mitake Shrine (武蔵御嶽神社 (Musashi Mitake Jinja)) can then be reached by trail—approximately 1000 meters.\nMany hikers access the mountain via Kori Station (two stops past Mitake Station from Ome).  There is a hiking trail that takes approximately two and half hours to reach the summit, which passes Otsukayama (920 metres).\nThere is also a festival every year on May 8.","","","","","","","","","","Mount Sobo (祖母山, Sobo-san) is one of the 100 Famous Japanese Mountains. The 1,756-metre-high (5,761 ft) mountain lies on the border of Taketa and Bungo-ōno in Ōita Prefecture and Takachiho, Nishiusuki District in Miyazaki Prefecture. It is the highest peak in Miyazaki Prefecture. In Ōita Prefecture only the 1,791 m (5,876 ft) middle peak of Mount Kujū is higher.\nThe Sobo Mountain range extends into three prefectures: Ōita, Miyazaki and Kumamoto.\nBecause of the volcanic activity which formed the mountain, huge rocks can be found everywhere around the mountain. There is a great variety of mountain climbing routes, ranging from animal trails to well maintained paths. Courses ae available from relaxed hiking for enjoyment to cliff climbing routes aimed at advanced climbers. Steep rock climbing routes can be seen from all trails in the neighbourhood of the summit.\nThe surroundings of Mount Sobo abound in mineral resources which were mined from the Edo period to the mid-Shōwa period.","","","","Mount Ōyama (大山, Ō-yama), also Mount Afuri (阿夫利山 or 雨降り山, Afuri-yama) or Mount Kunimi (Kunimi-yama), is a 1,252-metre-high (4,108 ft) mountain situated on the border of Isehara, Hadano and Atsugi in Kanagawa Prefecture, Japan. Together with Mount Tanzawa and other mountains in the Tanzawa Mountains it forms the Tanzawa-Ōyama Quasi-National Park. Mount Ōyama is a popular sightseeing spot in Kanagawa Prefecture.","","","","","Mount Osuzu is a mountain on the Japanese island of Kyushu. Part of an ancient volcanic formation known as the Osuzuyama volcano-plutonic complex, the mountain experienced a massive eruption in ~15.1 Ma. The mountain currently falls in the boundaries of Osuzu Prefectural Natural Park.","","","Mount Ōyama (大山, Ō-yama), also Mount Afuri (阿夫利山 or 雨降り山, Afuri-yama) or Mount Kunimi (Kunimi-yama), is a 1,252-metre-high (4,108 ft) mountain situated on the border of Isehara, Hadano and Atsugi in Kanagawa Prefecture, Japan. Together with Mount Tanzawa and other mountains in the Tanzawa Mountains it forms the Tanzawa-Ōyama Quasi-National Park. Mount Ōyama is a popular sightseeing spot in Kanagawa Prefecture.","","","","Kirishima Mountains (霧島山, Kirishima-yama) are a 1700 meter high active volcano group in Kagoshima Prefecture and Miyazaki Prefecture, Kyushu, Japan. Numerous eruptions have been recorded since 742. Very strong eruptions happened in 788, 1716 and 1717. Augite-hypersthene andesite is the dominant rock type.The highest peak is Karakuni-dake (韓国岳, Karakunidake) (1700 m). Its name literally means \"Korea Peak\"; it was once believed to be so high that the Korean Peninsula could be seen from its summit.  Other peaks include the sacred and often fabled in national foundation mythology, Takachiho-no-mine (高千穂峰) (1573 m) as well as Shinmoedake (新燃岳), both active volcanoes. They are part of Kirishima-Yaku National Park near Kirishima City.  Legend via oldest extant texts state the summit of Takachiho was stuck the mysterious spear Ama-no-Sakahoko, by the legendary Ninigi-no-Mikoto.   Mount Kirishima is considered one of the 100 Famous Japanese Mountains. The area is often foggy, and it is believed that the name Kirishima comes from the mountain looking like an island in the fog.\nThe Kongō-class battlecruiser Kirishima of the Imperial Japanese Navy, and the Kongō-class guided missile destroyer Kirishima of the Japan Maritime Self-Defense Force were both named after this mountain.\nShinmoedake is the most active of the Mount Kirishima volcanoes, having erupted in January 2011, March 2011, October 2017, and April 2018.The region as well as areas downstream is in the path of expanding Meiyu front from the continent, during the East Asian rainy season, potentially unleashing flash flooding and landslides during this time.\n\nKirishima Volcano Group","Kirishima Mountains (霧島山, Kirishima-yama) are a 1700 meter high active volcano group in Kagoshima Prefecture and Miyazaki Prefecture, Kyushu, Japan. Numerous eruptions have been recorded since 742. Very strong eruptions happened in 788, 1716 and 1717. Augite-hypersthene andesite is the dominant rock type.The highest peak is Karakuni-dake (韓国岳, Karakunidake) (1700 m). Its name literally means \"Korea Peak\"; it was once believed to be so high that the Korean Peninsula could be seen from its summit.  Other peaks include the sacred and often fabled in national foundation mythology, Takachiho-no-mine (高千穂峰) (1573 m) as well as Shinmoedake (新燃岳), both active volcanoes. They are part of Kirishima-Yaku National Park near Kirishima City.  Legend via oldest extant texts state the summit of Takachiho was stuck the mysterious spear Ama-no-Sakahoko, by the legendary Ninigi-no-Mikoto.   Mount Kirishima is considered one of the 100 Famous Japanese Mountains. The area is often foggy, and it is believed that the name Kirishima comes from the mountain looking like an island in the fog.\nThe Kongō-class battlecruiser Kirishima of the Imperial Japanese Navy, and the Kongō-class guided missile destroyer Kirishima of the Japan Maritime Self-Defense Force were both named after this mountain.\nShinmoedake is the most active of the Mount Kirishima volcanoes, having erupted in January 2011, March 2011, October 2017, and April 2018.The region as well as areas downstream is in the path of expanding Meiyu front from the continent, during the East Asian rainy season, potentially unleashing flash flooding and landslides during this time.\n\nKirishima Volcano Group","Kirishima Mountains (霧島山, Kirishima-yama) are a 1700 meter high active volcano group in Kagoshima Prefecture and Miyazaki Prefecture, Kyushu, Japan. Numerous eruptions have been recorded since 742. Very strong eruptions happened in 788, 1716 and 1717. Augite-hypersthene andesite is the dominant rock type.The highest peak is Karakuni-dake (韓国岳, Karakunidake) (1700 m). Its name literally means \"Korea Peak\"; it was once believed to be so high that the Korean Peninsula could be seen from its summit.  Other peaks include the sacred and often fabled in national foundation mythology, Takachiho-no-mine (高千穂峰) (1573 m) as well as Shinmoedake (新燃岳), both active volcanoes. They are part of Kirishima-Yaku National Park near Kirishima City.  Legend via oldest extant texts state the summit of Takachiho was stuck the mysterious spear Ama-no-Sakahoko, by the legendary Ninigi-no-Mikoto.   Mount Kirishima is considered one of the 100 Famous Japanese Mountains. The area is often foggy, and it is believed that the name Kirishima comes from the mountain looking like an island in the fog.\nThe Kongō-class battlecruiser Kirishima of the Imperial Japanese Navy, and the Kongō-class guided missile destroyer Kirishima of the Japan Maritime Self-Defense Force were both named after this mountain.\nShinmoedake is the most active of the Mount Kirishima volcanoes, having erupted in January 2011, March 2011, October 2017, and April 2018.The region as well as areas downstream is in the path of expanding Meiyu front from the continent, during the East Asian rainy season, potentially unleashing flash flooding and landslides during this time.\n\nKirishima Volcano Group","","","","","Mount Ontake (御嶽山, Ontake-san), also referred to as Mount Kiso Ontake (木曽御嶽山, Kiso Ontake-san), is the 14th highest mountain and second highest volcano in Japan (after Mount Fuji) at 3,067 m (10,062 ft). It is included in 100 Famous Japanese Mountains.","Mount Yae (八重岳, Yae-dake, Kunigami: Yē-dakī, Okinawan: Yē-daki), also known as Mount Yaedake or Yae-take, is a mountain in Motobu, Okinawa on Okinawa Island. It is the tallest mountain on the Motobu Peninsula, standing at 453.4 m (1,487 ft 6+1⁄2 in). Nakijin Castle and Nago Castle were built nearby in the 14th century. The mountain itself was used as a major Japanese defensive position during the Battle of Okinawa. Today it is famous for its annual Cherry Blossom Festival (桜祭り, Sakura Matsuri) held in March.","Mount Kanmuri (冠山, Kanmuri-yama, Kammuri-yama) is the name of several mountains in Japan.\n\nMount Kanmuri (Gifu, Fukui), located on the borders of Gifu and Fukui prefectures with a height of 1,256.6 m (4,123 ft)\nMount Kanmuri (Matsuyama), located in Matsuyama, Ehime Prefecture\nMount Kanmuri (Ehime, Kōchi), located on the borders of Ehime and Kōchi prefectures with a height of 1,732 m (5,682 ft)\nMount Kanmuri (Ōita), located in Ōita Prefecture with a height of 761 m (2,497 ft)\nMount Kanmuri (Hatsukaichi, Hiroshima), located in Hatsukaichi, Hiroshima Prefecture with a height of 1,339 m (4,393 ft)","","","","Kaimondake (開聞岳, Kaimondake, Kaimon-dake), or Mount Kaimon, is an undissected volcano – consisting of a basal stratovolcano and a small central volcano, part of the Ibusuki field – which rises to a height of 924 metres above sea level near the city of Ibusuki in southern Kyūshū, Japan. The last eruption occurred in the year 885. Kaimondake is sometimes referred to as \"the Fuji of Satsuma\".","","","","","","","","Mount Miyanoura (宮之浦岳, Miyanoura-dake) is a mountain in central Yakushima in Kagoshima Prefecture. \nAt an altitude of 1,936 m (6,352 ft), it is the highest peak of Yakushima and also the highest peak of the Kyushu region.\nThe mountains are registered in UNESCO World Heritage Site as \"Yakushima\".","Mount Nagata (71°21′S 162°47′E) is a mostly snow-covered mountain rising to 2,140 m, located 2 nautical miles (3.7 km) east of Mount Gow in the Bowers Mountains. Named by Advisory Committee on Antarctic Names (US-ACAN) in 1984 after Takesi Nagata (1913–91), pioneer in the study of paleomagnetism; Director, National Institute of Polar Research (Japan).","","","Mount Ontake (御嶽山, Ontake-san), also referred to as Mount Kiso Ontake (木曽御嶽山, Kiso Ontake-san), is the 14th highest mountain and second highest volcano in Japan (after Mount Fuji) at 3,067 m (10,062 ft). It is included in 100 Famous Japanese Mountains.","","","Mount Mitake (御岳山, Mitake-san) is a mountain in the Chichibu Tama Kai National Park near Tokyo, Japan. It stands 929 m (3,048 ft) tall. On the mountain is a Shinto shrine where practices such as Futomani divination take place.\nIt is one of the many highlights of the Chichibu Tama Kai National Park, which covers more than 1,250 km2 (483 sq mi) of forested mountains, hills, gorges and some rural towns in the prefectures of Yamanashi, Saitama, Nagano and Tokyo.\nThe trip from Tokyo's Shinjuku Station to Mitake Station on the Ōme Line takes about 95 minutes. \nA shuttle bus, located 50 meters to the left of Mitake Station, travels to Takimoto village every half-hour between 07:30 to 18:00. From Takimoto village, the Mitake-Tozan Railway cable car operates every half-hour between 07:30 to 18:30 and leads to Mitakesan village at its top. Mitake summit and the Musashi-Mitake Shrine (武蔵御嶽神社 (Musashi Mitake Jinja)) can then be reached by trail—approximately 1000 meters.\nMany hikers access the mountain via Kori Station (two stops past Mitake Station from Ome).  There is a hiking trail that takes approximately two and half hours to reach the summit, which passes Otsukayama (920 metres).\nThere is also a festival every year on May 8.","","","","","","Mount Yonaha (与那覇岳, Yonaha-dake), also known as Mount Yunaha (ユナハダキ, Yunaha-daki) in Okinawan, is a mountain in Kunigami on the main island of Okinawa in Okinawa Prefecture. It has an elevation of 503 m (1,650 ft), but Yonaha-dake triangulation station is located at the next peak of elevation of 498 m (1,634 ft).","Mount Yae (八重岳, Yae-dake, Kunigami: Yē-dakī, Okinawan: Yē-daki), also known as Mount Yaedake or Yae-take, is a mountain in Motobu, Okinawa on Okinawa Island. It is the tallest mountain on the Motobu Peninsula, standing at 453.4 m (1,487 ft 6+1⁄2 in). Nakijin Castle and Nago Castle were built nearby in the 14th century. The mountain itself was used as a major Japanese defensive position during the Battle of Okinawa. Today it is famous for its annual Cherry Blossom Festival (桜祭り, Sakura Matsuri) held in March.","Mount Onna (恩納岳, Onna-dake, Kunigami: Unna-dakī, Okinawan: Unna-daki) is a mountain in Onna Village, Okinawa. It is the highest point in central Okinawa, standing at 363 metres (1,191 ft). The village of Onna was named after the mountain during the Gusuku period.\n\n","Mount Omoto (於茂登岳, Omoto-dake, Yaeyama: Umutu-daki) is a mountain located on Ishigaki Island in Okinawa, Japan. Together, with Kabira Bay, it is a nationally designated Place of Scenic Beauty.","",""]